[
  {
    "question_text": "A lady in her 30s was presented to the ER with history of headache and neck pain started after her visit to the dentist. She has left sided Horner syndrome and ataxia.\n\nMRI done (image attached).\nWhich of the following is the most appropriate management?\n(Left vertebral artery dissection; lateral medullary syndrome)",
    "options": {
      "option_a": "Stenting",
      "option_b": "Angioplasty",
      "option_c": "Aspirin",
      "option_d": "Dual antiplatelets",
      "option_e": ""
    },
    "correct_answer": "C",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Vertebral artery dissection is a tear in the wall of the vertebral artery that may lead to thrombus formation and subsequent ischemia in the posterior circulation, manifesting as lateral medullary (Wallenberg) syndrome. Classic clinical findings include ipsilateral Horner syndrome, ataxia, dysphagia, and vertigo. A disruption in the intimal layer of the vertebral artery allows blood to enter and split the arterial wall, forming an intramural hematoma. This process can either narrow the vessel or generate emboli that cause infarcts, particularly in areas supplied by the vertebrobasilar system such as the lateral medulla. Current evidence shows that both antiplatelet and anticoagulant therapies produce similar outcomes. The patient’s presentation with headache and neck pain after a minor traumatic event (dental manipulation) along with left-sided Horner syndrome and ataxia is typical for a lateral medullary syndrome secondary to vertebral artery dissection. Diagnosis is based on imaging – MRI (including diffusion-weighted imaging) reveals infarction patterns, while MR angiography or CT angiography can demonstrate the dissection. Differential diagnoses include other causes of posterior circulation stroke such as cardioembolic events and vertebrobasilar insufficiency. According to current guidelines, first-line management is antithrombotic therapy. Most studies support the use of antiplatelet agents (such as aspirin) over anticoagulation for cervical artery dissections. In selected cases where there are recurrent events or failure of medical management, endovascular techniques (stenting, angioplasty) may be considered. In pregnancy and lactation, low-dose aspirin is generally considered safe. Option A (Stenting) and Option B (Angioplasty) are typically reserved for refractory cases or when there is evidence of worsening hemodynamic compromise. Option D (Dual antiplatelets) poses a higher bleeding risk and is not proven to be superior to monotherapy. Option C (Aspirin) is the standard and appropriate first-line management for vertebral artery dissection. 1. A history of recent minor trauma (even dental procedures) can precipitate arterial dissection. 2. Horner syndrome in the context of posterior circulation infarct is highly suggestive of vertebral artery involvement. Recent randomized studies have found no significant difference in outcomes between antiplatelet and anticoagulation therapies for cervical artery dissection. Current guidelines favor antiplatelet therapy because of its simplicity and safety profile, with ongoing research into optimal duration of therapy.",
    "exam_year": "2023",
    "exam_type": "Part I"
  },
  {
    "question_text": "Patient post RTA, image attached. Where is the localization of the lesion?",
    "options": {
      "option_a": "Internal carotid artery",
      "option_b": "Vertebral artery",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "In traumatic settings such as a road traffic accident (RTA), vascular injuries can occur secondary to cervical trauma. The vertebral artery, owing to its tortuous course through the transverse foramina of the cervical spine, is particularly vulnerable. Trauma can cause stretching or tearing of the vertebral arterial wall, leading to dissection, pseudoaneurysm formation, or complete occlusion. This mechanism can result in local ischemia or embolic events, contributing to neurological deficits. Following an RTA, if a patient exhibits signs of posterior circulation compromise (which might include dizziness, ataxia, or other focal neurological deficits), a vertebral artery injury should be suspected. Imaging findings on CT angiography or MR angiography typically confirm the lesion's location. A combination of clinical examination and imaging studies (CT angiography/MR angiography) is essential for localizing vascular injuries. Differentials include carotid artery injury, which is more common after hyperextension injuries but has a different clinical and imaging profile. Management is usually conservative with antithrombotic therapy (antiplatelets or anticoagulants) unless there is evidence of progression or significant hemodynamic compromise. For pregnant patients or lactating mothers with similar injuries, low-dose aspirin is generally acceptable, though decisions must be individualized. Option A (Internal carotid artery) is a possible site for traumatic dissection but does not match the imaging and clinical scenario provided. The presented image and history (post RTA) support a vertebral artery lesion as indicated by Option B. 1. In trauma, always consider cervical artery dissection even in the absence of overt neck injury. 2. CT angiography is the gold standard for evaluating suspected traumatic vascular injuries in the neck. Updated trauma protocols emphasize early vascular imaging in patients with high-risk mechanisms of injury. Recent literature supports the use of antithrombotic therapy for vertebral artery injuries, with outcomes similar to those seen in spontaneous dissections.",
    "exam_year": "2023",
    "exam_type": "Part I"
  },
  {
    "question_text": "A 20s-year-old male with history of learning difficulty presented to the clinic with his father due to repeated history of stroke like symptoms, dysarthria, and hearing loss. MRI brain done (image attached). What is the most likely diagnosis?",
    "options": {
      "option_a": "MELAS",
      "option_b": "CADSAIL",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "CADASIL (Cerebral Autosomal Dominant Arteriopathy with Subcortical Infarcts and Leukoencephalopathy) is a hereditary small vessel disease that typically presents with migraine with aura, recurrent ischemic strokes, cognitive impairment, and sometimes psychiatric symptoms. A family history with autosomal dominant inheritance is a hallmark. Mutations in the NOTCH3 gene result in abnormal protein deposition and degeneration of vascular smooth muscle cells, leading to thickening and fibrosis of small penetrating arteries. This process causes chronic white matter ischemia and lacunar infarcts. Although MELAS (Mitochondrial Encephalomyopathy, Lactic Acidosis, and Stroke-like episodes) also causes stroke-like events, its mitochondrial (maternal) inheritance pattern and different imaging characteristics help differentiate it from CADASIL. The patient’s history of early learning difficulties, recurrent stroke-like episodes (manifested by dysarthria and other focal neurological deficits), and hearing loss, combined with the fact that his father is affected, points toward a familial disorder with autosomal dominant inheritance. In MELAS, the maternal inheritance pattern is key, and hearing loss, though common, would not typically appear with a paternal transmission. Diagnosis of CADASIL involves a combination of clinical history, characteristic MRI findings (such as white matter hyperintensities in the anterior temporal lobes), and genetic testing for NOTCH3 mutations. The differential includes MELAS (which demonstrates stroke-like lesions not confined to vascular territories and is maternally inherited) and other hereditary leukoencephalopathies. There is no definitive disease-modifying therapy for CADASIL. Management is largely supportive and focuses on controlling vascular risk factors, preventing ischemic events with antiplatelet therapy when indicated, and providing symptomatic treatment for migraines and cognitive dysfunction. Genetic counseling is essential. In pregnancy and lactation, risk factor management is critical, and therapies such as low-dose aspirin can be used with caution. Option A (MELAS) is incorrect due to its maternal inheritance pattern and typically different MRI findings (stroke-like lesions that do not conform to vascular territories). Option B (CADSAIL, a representation of CADASIL) is correct due to the autosomal dominant inheritance (the father’s involvement), characteristic clinical presentation, and appropriate imaging findings. Options C and D are not provided and thus not applicable. 1. A family history involving affected male relatives strongly suggests an autosomal dominant disorder such as CADASIL. 2. Characteristic MRI findings (anterior temporal white matter lesions) are a key diagnostic clue for CADASIL. Recent advances have improved the understanding of NOTCH3 mutations in CADASIL, and while no curative treatment exists, research is focusing on potential targeted therapies. Updated guidelines emphasize the importance of controlling vascular risk factors and genetic counseling in management.",
    "exam_year": "2023",
    "exam_type": "Part I"
  },
  {
    "question_text": "A 70-year-old male, known case of hypertension. He went to sleep then woke up in the morning with left sided weakness and dysarthria.\n\nMRI brain done (image attached).\nWhat is the most likely pathophysiology involved in his condition?",
    "options": {
      "option_a": "Amyloid angiopathy",
      "option_b": "Hemorrhagic stroke",
      "option_c": "Hypertensive hemorrhage",
      "option_d": "Autoregulation dysfunction",
      "option_e": ""
    },
    "correct_answer": "C",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Hypertensive hemorrhage refers to intracerebral hemorrhage resulting from long-standing high blood pressure. Chronic hypertension leads to changes in the small vessels (arterioles) that predispose them to rupture, typically in deep brain structures. Chronic hypertension causes lipohyalinosis and the formation of Charcot-Bouchard microaneurysms in small penetrating arteries. This weakening of vessel walls leads to rupture and hemorrhage, most frequently in areas such as the basal ganglia, thalamus, pons, or cerebellum. The sudden rupture accounts for the acute onset of symptoms. The elderly male with a known history of hypertension who wakes with sudden left-sided weakness and dysarthria is highly suggestive of an intracerebral hemorrhage due to hypertensive small vessel disease. The focal deficits correlate with the location of the hemorrhage, likely involving motor pathways. Non-contrast CT scan is the preferred initial diagnostic tool to differentiate hemorrhagic from ischemic stroke. MRI can provide additional details regarding the location and extent of the hemorrhage. Differential diagnoses include lobar hemorrhages due to amyloid angiopathy (which typically affect cortical/subcortical regions) and ischemic stroke with hemorrhagic conversion. Management includes rapid blood pressure control, supportive care, and neurosurgical evaluation if indicated. First-line management involves lowering blood pressure to prevent hematoma expansion. Secondary prevention includes strict control of hypertension and other vascular risk factors. In patients who are pregnant or lactating, blood pressure management should be tailored with agents that are safe in these populations (e.g., labetalol, hydralazine), though this scenario is less applicable in a 70-year-old male. Option A (Amyloid angiopathy) is more common in non-hypertensive elderly patients and typically produces lobar hemorrhages rather than deep hemorrhages seen in hypertension. Option B (Hemorrhagic stroke) is a broad term that includes hypertensive hemorrhage; however, Option C specifically identifies hypertensive hemorrhage, which is the most precise answer. Option D (Autoregulation dysfunction) describes a mechanism that may contribute to hemorrhage but is not the primary diagnosis. 1. Deep intracerebral hemorrhages in hypertensive patients are most commonly due to small vessel lipohyalinosis. 2. Rapid blood pressure management is critical in the acute phase to minimize hematoma expansion. Recent guidelines emphasize early and aggressive blood pressure control in hypertensive hemorrhage. Ongoing research focuses on neuroprotective strategies and minimally invasive surgical techniques to improve outcomes in intracerebral hemorrhage.",
    "exam_year": "2023",
    "exam_type": "Part I"
  },
  {
    "question_text": "Female patient with ESRD on regular hemodialysis complaining of recurrent TIAs last for less than 10 minutes inform of left sided weakness and dysarthria then resolved completely. These symptoms occur during the dialysis sessions. CT brain done and showed evidence of old ischemic stroke. Carotid US done and showed left ICA atherosclerotic changes with no visualized stenosis or occlusion. Which of the following is important to order during evaluation of this patient?",
    "options": {
      "option_a": "CT angiography",
      "option_b": "MRI brain",
      "option_c": "CT Venogram",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "A",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Transient ischemic attacks (TIAs) are brief episodes of neurological dysfunction resulting from temporary cerebral ischemia. In this patient with end‐stage renal disease (ESRD) on hemodialysis, recurrent TIAs occurring during dialysis sessions raise suspicion for an underlying vascular pathology potentially compounded by intradialytic hypotension. Although the carotid ultrasound showed non‐stenotic atherosclerotic changes in the left internal carotid artery (ICA), the episodes suggest the possibility of intracranial vascular abnormalities that need further evaluation. ESRD patients are prone to vascular calcifications and atherosclerosis. During hemodialysis, rapid fluid removal can lead to hypotensive episodes, compromising cerebral perfusion. Atherosclerotic changes—even without significant stenosis on extracranial imaging—may coexist with intracranial vascular disease, microembolism, or flow alterations. CT angiography (CTA) is sensitive in detecting subtle abnormalities (e.g., non‐critical intracranial stenosis, small vessel irregularities) that might explain these recurrent transient ischemic events. The patient’s presentation of transient left-sided weakness with dysarthria, which resolves completely, is typical for TIA. The temporal association of symptoms with dialysis sessions suggests a hemodynamic component possibly compounded by vascular pathology. The old ischemic stroke seen on CT and the carotid ultrasound findings prompt further investigation of the intracranial vasculature. After a normal carotid ultrasound (for significant stenosis), the next step is to assess intracranial vasculature. Differential diagnoses include intracranial atherosclerosis, embolic phenomena related to vascular access, or phenomena related to hypoperfusion. CTA is the most appropriate non-invasive test to evaluate both extracranial and intracranial arterial anatomy, helping differentiate between these causes. While the immediate management often involves antiplatelet therapy and risk factor modification, identifying the underlying vascular cause is paramount. Guidelines recommend prompt vascular imaging with CTA in patients with TIA, particularly when clinical suspicion for intracranial involvement is high. In ESRD patients, contrast use is a consideration; however, current protocols help minimize risks. Adjustments during dialysis (e.g., managing blood pressure) are also important. If the patient were pregnant, radiation exposure and contrast type would be carefully weighed but in ESRD patients, the risk of contrast is managed by hydration protocols and using contrast agents with low nephrotoxicity when possible. Option A (CT angiography) is correct because it provides detailed visualization of the intracranial vessels. Option B (MRI brain) is less ideal in this setting because while it is excellent for parenchymal detail, it may not adequately delineate vascular stenoses in an ESRD patient and may require gadolinium, which is contraindicated in advanced renal disease. Option C (CT Venogram) is used for evaluating the venous system and is not indicated when looking for arterial pathologies causing TIAs. 1. TIAs in patients on hemodialysis can be precipitated by hypotensive episodes during the session. 2. Carotid ultrasound only evaluates extracranial vessels; intracranial vascular imaging (CTA) is necessary when suspicion remains high. 3. Early vascular imaging leads to more targeted management, preventing potential strokes. Recent AHA/ASA guidelines emphasize the importance of early vascular imaging (preferably CTA) in TIA patients to identify both extracranial and intracranial pathologies. In patients with ESRD, strategies to minimize contrast exposure are in place, but CTA remains the imaging modality of choice when clinical concern for intracranial stenosis exists.",
    "exam_year": "2023",
    "exam_type": "Part I"
  },
  {
    "question_text": "Elderly male in the 60s with hypertension and diabetes mellitus presented with sudden onset right sided weakness. Symptoms was started 5 hours ago. BP 180/100, HR 83. Examination showed aphasia with left gaze preference. NIHSS 16. CT brain done (image attached). ASPEC score is 8.\nWhich of the following is the appropriate management for this patient?",
    "options": {
      "option_a": "Intraarterial thrombolysis",
      "option_b": "Mechanical thrombectomy",
      "option_c": "IV thrombolysis",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Acute ischemic stroke management is time-sensitive. Revascularization therapies are guided by time from onset, imaging findings, and stroke severity. In this case, the elderly male presents 5 hours after symptom onset with high NIHSS and an ASPECTS score of 8, suggesting there is salvageable brain tissue despite a significant deficit. Large vessel occlusions result from thromboembolic events, leading to abrupt cessation of blood flow to a brain region. The ASPECTS score on CT provides a quantitative measure of early ischemic changes; a score of 8 indicates limited early ischemic damage, supporting the potential benefit of reperfusion therapies. Mechanical thrombectomy directly removes the thrombus, thereby restoring blood flow and minimizing further ischemic injury. The patient’s clinical findings—right-sided weakness, aphasia, and left gaze preference with a high NIHSS score—are indicative of a large vessel occlusion. The time frame (5 hours from onset) places him outside the optimal window for IV thrombolysis (typically within 4.5 hours), making mechanical thrombectomy the preferred treatment option. Initial non-contrast CT is used to rule out hemorrhage and assess early infarction via ASPECTS. CT angiography (CTA) further confirms the occlusion site. Differential diagnoses include stroke mimics such as seizures or hypoglycemia, but the clinical picture and imaging findings support a diagnosis of acute ischemic stroke due to large vessel occlusion. According to current stroke guidelines, patients presenting with large vessel occlusions within an extended time window (up to 24 hours in select cases based on imaging) are candidates for mechanical thrombectomy. First-line treatment for eligible patients is mechanical thrombectomy. IV thrombolysis is typically reserved for those presenting within 4.5 hours and without contraindications. For pregnant or lactating patients, mechanical thrombectomy is also favored because it avoids systemic thrombolytic risks. Secondary management includes blood pressure control and supportive care. Option A (Intraarterial thrombolysis) is less favored compared to mechanical thrombectomy in current practice. Option B (Mechanical thrombectomy) is correct as it is the recommended treatment for large vessel occlusion in this time window. Option C (IV thrombolysis) is not appropriate given that the patient presented beyond the recommended 4.5-hour window. 1. ASPECTS score is crucial in determining the extent of early ischemic changes; a score of 8 is favorable for thrombectomy. 2. The window for IV thrombolysis is generally within 4.5 hours, whereas mechanical thrombectomy can be extended based on imaging findings. 3. Rapid revascularization is key to improving outcomes in large vessel occlusion strokes. Recent trials, including DAWN and DEFUSE 3, have demonstrated the benefit of mechanical thrombectomy in selected patients up to 24 hours after symptom onset. These studies have shaped current guidelines which now advocate for mechanical thrombectomy in patients with salvageable brain tissue as evidenced on advanced imaging.",
    "exam_year": "2023",
    "exam_type": "Part I"
  },
  {
    "question_text": "Young patient presented with acute severe headache associated with nausea and vomiting. He recently diagnosed with depression and started on escitalopram. Neurological examination was unremarkable. Cerebral angiography done (imaged attached).\nWhich of the following is the most likely diagnosis?",
    "options": {
      "option_a": "Fibromuscular dysplasia At the level of carotid",
      "option_b": "Isolated angiitis of central nervus system.",
      "option_c": "Reversible cerebral vasoconstriction syndrome.",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "C",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Reversible cerebral vasoconstriction syndrome (RCVS) is characterized by transient narrowing of cerebral arteries leading to sudden and often recurrent severe headaches (commonly thunderclap headaches). It is frequently triggered by vasoactive substances including selective serotonin reuptake inhibitors (SSRIs), as in this patient who was recently started on escitalopram. RCVS is thought to arise from dysregulation of cerebral arterial tone, resulting in reversible vasoconstriction. Although the exact pathogenesis is unclear, the association with vasoactive agents (such as SSRIs) suggests that external triggers can precipitate abnormal vasomotor reactivity. The angiographic hallmark is a multifocal narrowing (beading) of the cerebral arteries that typically resolves within weeks to months. The patient’s presentation with an acute severe headache accompanied by nausea and vomiting, in the context of a recent SSRI initiation, is highly suggestive of RCVS. The normal neurological examination further supports this diagnosis, as significant deficits are often absent unless complications like stroke occur. Cerebral angiography is the diagnostic modality of choice for RCVS. The typical 'string-of-beads' appearance due to multifocal segmental narrowing is seen. Differential diagnosis includes primary angiitis of the central nervous system (PACNS), which usually has a more insidious onset and may present with cognitive changes, and fibromuscular dysplasia, which is typically seen in middle-aged women and has a different angiographic pattern. Management of RCVS is primarily supportive. First-line treatment includes removal of any potential triggers (e.g., discontinuing the SSRI if clinically feasible) and symptomatic relief. Calcium channel blockers such as nimodipine may be used to alleviate vasospasm. In severe or refractory cases, careful blood pressure management and hospitalization may be warranted. In pregnancy or lactation, treatment should be individualized with a preference for agents with favorable safety profiles. Option A (Fibromuscular dysplasia) is less likely given the patient’s demographic and clinical picture. Option B (Isolated angiitis of the central nervous system) typically presents with a more progressive course and often abnormal CSF findings. Option C (Reversible cerebral vasoconstriction syndrome) is the correct answer, as it best fits the patient’s acute presentation, recent SSRI use, and expected angiographic findings. 1. RCVS typically presents with recurrent thunderclap headaches and may be triggered by medications like SSRIs. 2. Angiography reveals a characteristic 'string-of-beads' appearance, which helps differentiate it from other vasculopathies. 3. The condition is reversible in most cases with appropriate trigger avoidance and supportive management. Recent literature emphasizes that RCVS is often self-limited, with most patients recovering fully within a few months. Updated guidelines advocate for conservative management focusing on trigger avoidance and blood pressure control, with calcium channel blockers being used in patients with severe or persistent symptoms.",
    "exam_year": "2023",
    "exam_type": "Part I"
  },
  {
    "question_text": "Female patient in her 30s presented to the ER with history of progressive headache started 10 days ago, associated with nausea, vomiting, and blurry vision. She is currently on oral contraceptive pills. Physical examination was remarkable for bilateral papilledema. CT brain and CTV done (image attached). Which of the following is appropriate management? (CVT)",
    "options": {
      "option_a": "Antiplatelet",
      "option_b": "Anticoagulant",
      "option_c": "Intravascular thrombectomy",
      "option_d": "Carbonic anhydrase",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Cerebral venous thrombosis (CVT) is a clotting disorder affecting the dural venous sinuses, leading to impaired venous drainage, increased intracranial pressure, and subsequent neurological symptoms. The patient, a young woman on oral contraceptives, presents with a classic picture including a progressive headache, papilledema, nausea, and visual disturbances. CVT results from thrombosis in the cerebral venous system, leading to venous congestion and raised intracranial pressure. Risk factors include oral contraceptive use, inherited thrombophilias, and other hypercoagulable states. The increased venous pressure can result in cerebral edema, venous infarcts, and sometimes hemorrhage. The condition is diagnosed radiologically, often with CT venography (CTV) or MR venography. The patient’s progressive headache over 10 days with associated nausea, vomiting, blurred vision, and bilateral papilledema strongly suggests raised intracranial pressure secondary to CVT. Her use of oral contraceptive pills further increases her risk of developing thrombosis. CT brain and CT venography (CTV) are typically employed for diagnosis. Differential diagnoses include idiopathic intracranial hypertension (IIH), which also presents with headache and papilledema but usually lacks identifiable venous sinus thrombosis, and space-occupying lesions. D-dimer testing and evaluation for thrombophilic states are also part of the diagnostic workup. The mainstay of treatment for CVT is anticoagulation, even in the presence of hemorrhagic components. First-line management involves initiating low molecular weight heparin (LMWH), followed by transition to oral anticoagulants for a duration typically ranging from 3 to 12 months depending on risk factors. Endovascular thrombectomy is reserved for refractory cases or clinical deterioration despite appropriate anticoagulation. For pregnant or lactating patients, LMWH is preferred due to its safety profile. Option A (Antiplatelet) is not indicated as CVT is a thrombotic condition primarily managed with anticoagulation. Option B (Anticoagulant) is correct and represents the standard first-line management for CVT. Option C (Intravascular thrombectomy) is reserved for patients who fail standard anticoagulation therapy. Option D (Carbonic anhydrase inhibitors) is more appropriate for idiopathic intracranial hypertension rather than CVT. 1. Oral contraceptive use is a well-known risk factor for CVT. 2. Anticoagulation is the cornerstone of CVT management even when intracerebral hemorrhage is present. 3. Early diagnosis and treatment are key to preventing long-term neurological deficits. Recent guidelines, including those from the American Heart Association and European Stroke Organization, continue to advocate for anticoagulation as the first-line treatment for CVT. Studies have reinforced that even in cases with hemorrhagic transformation, anticoagulation improves outcomes. In pregnant patients, LMWH remains the treatment of choice due to its favorable safety profile.",
    "exam_year": "2023",
    "exam_type": "Part I"
  },
  {
    "question_text": "Patient with 3rd nerve palsy, tremor, hearing loss.",
    "options": {
      "option_a": "AICA",
      "option_b": "PICA",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "A",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question asks about a brainstem vascular syndrome. The key features – hearing loss and tremor – strongly suggest involvement of areas supplied by the anterior inferior cerebellar artery (AICA). Although third nerve (oculomotor) palsy is not the classical finding in AICA infarction (where facial nerve involvement is more typical), when presented with two major signs (hearing loss and tremor/coordination issues), AICA is the most appropriate answer among the options provided. AICA typically supplies the lateral pons, portions of the cerebellum, and the inner ear via the labyrinthine artery. Occlusion leads to ischemia in these regions. Hearing loss occurs due to cochlear nerve ischemia, and involvement of cerebellar pathways may manifest as tremor or ataxia. While a true third nerve palsy usually involves midbrain structures, in exam scenarios sometimes atypical or mixed descriptions are provided, and the presence of hearing loss guides you to AICA rather than PICA, which is associated with lateral medullary (Wallenberg) syndrome. Patients with AICA-related infarcts can present with acute onset of vertigo, nausea, hearing loss, facial weakness, and cerebellar signs (such as tremor or ataxia). Even though oculomotor involvement is unusual, when the key finding of hearing loss is present, AICA is favored over PICA, which typically presents with dysphagia, hoarseness, and loss of pain/temperature sensation on the contralateral body. Imaging studies such as magnetic resonance imaging (MRI) with diffusion‐weighted sequences and magnetic resonance angiography (MRA) help delineate the vascular territory involved. Differential diagnoses include other brainstem strokes (e.g., PICA infarct causing lateral medullary syndrome) and cerebellopontine angle lesions (e.g., acoustic neuroma). The presence of hearing loss is pivotal in differentiating AICA territory infarcts from others. Acute management of AICA infarcts follows general ischemic stroke protocols including potential thrombolysis if within the therapeutic window and no contraindications exist. Supportive care, antiplatelet therapy, and rehabilitation are key. In pregnancy or lactation, management should adhere to stroke guidelines while choosing medications with safety profiles in these populations (e.g., avoiding agents contraindicated in pregnancy). Option A (AICA) is chosen because of the hearing loss and tremor which implicate the territory of the AICA. Option B (PICA) is less likely because PICA infarcts (Wallenberg syndrome) typically do not produce hearing loss and have other hallmark features like dysphagia and hoarseness. 1. Hearing loss in an acute brainstem syndrome should immediately raise suspicion for an AICA infarct. 2. Although third nerve palsy is not classic for AICA, exam questions may occasionally mix cranial nerve findings to test your ability to prioritize the most distinguishing features. 3. Always correlate clinical signs with vascular territories when evaluating brainstem strokes. Recent advances in neuroimaging have enhanced our ability to localize strokes to specific vascular territories. Current stroke protocols and guidelines continue to stratify posterior circulation strokes based on clinical findings, and while third nerve involvement is rare in AICA occlusions, the presence of cochlear involvement remains a key determinant.",
    "exam_year": "2024",
    "exam_type": "Part I"
  },
  {
    "question_text": "Intracranial bleed and asked about the blood pressure management.",
    "options": {
      "option_a": "140/90",
      "option_b": "160/90",
      "option_c": "130/90",
      "option_d": "120/90",
      "option_e": ""
    },
    "correct_answer": "A",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Intracranial hemorrhage (ICH) is a neurological emergency where blood pressure management is central to reducing hematoma expansion. The primary concept here is to lower the blood pressure safely without compromising cerebral perfusion. Acute hypertension in the setting of ICH increases the risk of ongoing bleeding due to higher hydrostatic pressures which force more blood out of the ruptured vessel. Lowering the blood pressure reduces this risk, as demonstrated by studies like INTERACT2, which showed benefit in reducing hematoma enlargement when systolic pressures are lowered. Patients with ICH often present with a sudden headache, neurological deficits, and alterations in consciousness. Early and controlled blood pressure reduction is critical to prevent secondary brain injury from hematoma expansion. Computed tomography (CT) of the head is the gold standard for diagnosing ICH. Differential considerations include ischemic stroke with hemorrhagic transformation and subarachnoid hemorrhage, each of which requires distinct management strategies. Continuous blood pressure monitoring is integral. First-line management includes intravenous antihypertensive therapy (commonly IV nicardipine or labetalol) with a target systolic blood pressure near 140 mmHg. Second-line agents are considered if the goal is not met. In patients who are pregnant or lactating, blood pressure agents with established safety (such as labetalol or hydralazine) should be used while avoiding contraindicated drugs (like ACE inhibitors). Option A (140/90 mmHg) is in line with current guidelines, which recommend lowering systolic blood pressure to around 140 mmHg. Options B (160/90), C (130/90), and D (120/90) either do not align with the recommended target or are not supported by evidence in the setting of ICH. 1. Aggressive but controlled blood pressure management in ICH is correlated with better outcomes. 2. The INTERACT2 trial reinforces a target systolic of 140 mmHg in ICH patients. 3. Always tailor antihypertensive therapy to the individual patient’s context, including pregnancy and lactation when applicable. Recent updates from stroke guidelines, including evidence from the INTERACT2 trial and subsequent expert recommendations, support the target of reducing systolic blood pressure to 140 mmHg in the acute management of ICH.",
    "exam_year": "2024",
    "exam_type": "Part I"
  },
  {
    "question_text": "22 YO, F, medically free, on Combined OCB, came with headache, CTV showed SSS thrombosis, what is true.",
    "options": {
      "option_a": "She has clear cause and no need workup",
      "option_b": "Do thrombophilia workup",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "A",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Cerebral venous sinus thrombosis (CVST) is a type of stroke resulting from thrombosis in the dural venous sinuses. In young women, the use of combined oral contraceptive pills (COCP) is a well‐recognized, reversible risk factor. Exogenous estrogen from COCPs can increase the production of coagulation factors and reduce anticoagulant proteins, tipping the hemostatic balance toward thrombosis. When thrombosis occurs in the superior sagittal sinus, it results in impaired venous drainage and increased intracranial pressure. CVST commonly presents in young women with headache, seizures, and possibly focal neurological deficits. In this case, a 22‐year‐old female on COCPs with headache and imaging evidence of superior sagittal sinus thrombosis demonstrates a classic clinical scenario. The diagnosis is confirmed through imaging studies such as CT venography (CTV) or MR venography (MRV). Differential diagnoses include migraine, idiopathic intracranial hypertension, and other causes of headache. A thorough history often reveals a provoking factor like COCP use. The mainstay of treatment for CVST is anticoagulation (typically with low-molecular-weight heparin initially, followed by oral anticoagulants). It is advisable to defer extensive thrombophilia testing during the acute phase because acute phase reactants and anticoagulation can alter results. In pregnant or lactating women, low-molecular-weight heparin is favored due to its safety profile. Option A states that because there is a clear provoking factor (COCP use), no further workup is immediately necessary, which is in line with many guidelines. Option B (perform a thrombophilia workup) might be considered in cases with no clear cause or a family history of thrombosis, but in this scenario, the COCP is a sufficient explanation. Testing for thrombophilia is usually deferred until after the acute phase (often several months later) to avoid confounding results. 1. In a young female with CVST and COCP use, the contraceptive is typically the provocative risk factor, and routine thrombophilia screening can usually be deferred. 2. Repeat thrombophilia testing may be performed after the acute phase has resolved, as initial tests can be inaccurate due to the acute event and anticoagulant effects. 3. Anticoagulation remains the cornerstone of CVST management despite any hemorrhagic transformation on imaging. Current guidelines, including those from the American Heart Association, suggest that in the setting of a clear provoking factor, extensive thrombophilia evaluation is not mandatory during the acute phase of CVST. This approach helps avoid unnecessary interventions and misinterpretation of results.",
    "exam_year": "2024",
    "exam_type": "Part I"
  },
  {
    "question_text": "Lady on OCP came with seizure, headache, CT normal, next.",
    "options": {
      "option_a": "LP",
      "option_b": "EEG",
      "option_c": "CTV",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "C",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "In women on oral contraceptives presenting with headache and seizures, cerebral venous sinus thrombosis (CVST) is a prime consideration—even when the initial non-contrast CT scan is normal. CVST often requires advanced imaging for diagnosis. CVST results from clot formation in the cerebral venous sinuses, leading to impaired venous drainage, increased intracranial pressure, and potential venous infarctions or hemorrhages. OCP use is a risk factor because it creates a hypercoagulable state that predisposes to thrombosis. Clinically, patients may present with headache, seizures, focal neurological deficits, or papilledema. A normal CT scan does not exclude CVST; therefore, further imaging with dedicated venographic techniques is warranted. When suspicion for CVST remains high despite a normal CT, CT venography (CTV) or MR venography (MRV) should be performed to visualize the venous system and detect the presence of thrombi. Differential diagnoses in such cases include primary seizure disorders and meningitis, but the OCP history directs attention toward thrombotic causes. Once CVST is diagnosed, the first-line treatment is anticoagulation (typically with low-molecular-weight heparin followed by warfarin or a direct oral anticoagulant). In cases where the patient is pregnant or lactating, LMWH is the preferred treatment due to its established safety profile in these populations. Option A (LP) is not indicated in this scenario because lumbar puncture would not visualize venous clot and may risk herniation if intracranial pressure is high. Option B (EEG) is used to evaluate seizure activity but does not address the underlying etiology. Option C (CTV) is the correct next step to evaluate for CVST. The absence of a fourth option confirms that CTV is the most sensitive and specific noninvasive test in this context. 1. A normal non-contrast CT does not rule out CVST; always consider venography in high-risk patients. 2. In patients on OCPs with new-onset headache and seizures, CVST is a critical diagnosis to exclude. 3. Early diagnosis and management of CVST with appropriate imaging can substantially improve outcomes. Recent guidelines emphasize the use of CT venography as a critical tool in the evaluation of suspected CVST, given its high sensitivity and rapid availability. Studies continue to support early anticoagulation as the cornerstone of treatment even if initial CT imaging appears normal.",
    "exam_year": "2024",
    "exam_type": "Part I"
  },
  {
    "question_text": "This pic patient will came with (image of brain MRI) (Similar but not the same).",
    "options": {
      "option_a": "Pure motor",
      "option_b": "Pure sensory",
      "option_c": "Mixed",
      "option_d": "Clumsy",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Lacunar strokes are small subcortical infarctions typically caused by occlusion of small perforating arteries. One well‐recognized lacunar syndrome is the pure sensory stroke, which is usually due to an infarct in the ventral posterolateral (VPL) nucleus of the thalamus. Chronic hypertension and diabetes can lead to lipohyalinosis of small penetrating arteries. When one of these vessels supplying the thalamus becomes occluded, it disrupts the sensory pathways without affecting motor fibers. This results in an infarct that produces isolated sensory deficits in the contralateral hemibody. Patients with a pure sensory stroke typically present with sudden onset contralateral numbness or loss of sensory modalities (pain, temperature, proprioception) without motor weakness. An MRI demonstrating a small lacunar infarct in the thalamus correlates with these clinical findings. Magnetic resonance imaging (especially DWI) is highly sensitive for detecting lacunar infarcts. Differential diagnoses include: (a) infarcts in the posterior limb of the internal capsule (which cause pure motor deficits), (b) sensorimotor strokes (when both motor and sensory functions are affected) and (c) demyelinating diseases. Detailed clinical history and risk factor assessment help differentiate these entities. Acute management includes antiplatelet therapy (e.g., aspirin), aggressive blood pressure and risk factor control, and secondary prevention strategies. In pregnant or lactating patients with stroke, low-dose aspirin is generally considered safe with careful monitoring, and risk factor modification is essential. Option A (Pure motor) is seen with lacunar infarcts in areas like the posterior limb of the internal capsule. Option B (Pure sensory) is correct because a thalamic lacunar infarct typically leads to isolated sensory deficits. Option C (Mixed) would be expected with sensorimotor strokes where both motor and sensory areas are involved. Option D (Clumsy) hints at ataxic hemiparesis, which involves a combination of motor weakness and clumsiness – not isolated sensory loss. 1. A pure sensory stroke is most commonly due to a lacunar infarct in the thalamic VPL nucleus. 2. Appropriate blood pressure control is crucial in preventing subsequent small vessel damage. Recent guidelines emphasize the importance of managing vascular risk factors to prevent lacunar strokes. High-resolution MRI and DWI are the imaging modalities of choice for early detection, and evidence supports the use of antiplatelet agents as part of secondary prevention.",
    "exam_year": "2024",
    "exam_type": "Part I",
    "image_url": "page_15.png"
  },
  {
    "question_text": "82 YO female with good functional status although she has mild osteoporosis in her knees related to her age, came with NIHSS = 20 in term of aphasia, right side weakness, she presented within 60 min, CT done within 30 min, BP 220/110, next step.",
    "options": {
      "option_a": "Give tpa",
      "option_b": "BP management",
      "option_c": "CTA",
      "option_d": "Mechanical Thrombectomy",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Acute ischemic stroke management follows a time‐sensitive approach with reperfusion therapy (IV tPA and/or mechanical thrombectomy) being standard treatments. However, proper patient selection – including blood pressure control – is critical to avoid complications. Extremely elevated blood pressure in the acute stroke setting increases the risk of hemorrhagic conversion, especially if thrombolytic therapy is administered while BP exceeds recommended thresholds. The concern is that high intravascular pressures can disrupt the blood–brain barrier integrity during reperfusion. In this elderly patient with a high NIHSS score (indicative of a significant ischemic stroke) and severely elevated blood pressure (220/110 mm Hg), immediate control of BP is mandatory before any reperfusion therapy can be initiated. Elevated BP is both a physiological response to stroke and a modifiable risk factor. After non-contrast CT rules out hemorrhage, further vascular imaging like CTA is often used to identify large vessel occlusions. Differential considerations include hypertensive encephalopathy and other causes of intracranial hemorrhage; however, the clinical picture along with CT findings supports ischemic stroke. Blood pressure must be addressed promptly to meet criteria for IV thrombolysis. The first step is to lower the BP to at most 185/110 mm Hg using fast-acting intravenous agents (such as labetalol or nicardipine), as per American Heart Association guidelines. Once BP is controlled, IV thrombolysis (if criteria are met) or mechanical thrombectomy (if a large vessel occlusion is present) can be considered. In pregnancy or lactation, choice of antihypertensive agents requires careful consideration; labetalol is often preferred due to its relatively safe profile in these settings. Option A (Give tPA) is contraindicated until BP is lowered below the recommended threshold. Option B (BP management) is correct as immediate blood pressure reduction is essential before reperfusion therapies are safe. Option C (CTA) is important in the evaluation process, but with BP at 220/110 mm Hg, the priority is to manage BP first. Option D (Mechanical Thrombectomy) might be considered later, but only after BP is adequately controlled and vascular imaging confirms eligibility. 1. For IV tPA eligibility, blood pressure must be below 185/110 mm Hg. 2. Rapid control of hypertension in acute stroke is crucial to minimize the risk of hemorrhagic transformation. Updated stroke guidelines reinforce that severe hypertension is a contraindication for immediate thrombolysis until it is brought under control. Recent studies support the use of intravenous antihypertensives to safely lower BP in eligible patients.",
    "exam_year": "2024",
    "exam_type": "Part I"
  },
  {
    "question_text": "Patient came with left side weakness MRI showed right lacunar stroke, CTA showed severe intracranial right MCA stenosis.",
    "options": {
      "option_a": "ASA",
      "option_b": "IV thrombolysis",
      "option_c": "DAPT",
      "option_d": "Stent",
      "option_e": ""
    },
    "correct_answer": "C",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Management of intracranial atherosclerotic disease, especially when it is symptomatic, centers on aggressive medical therapy. Dual antiplatelet therapy (DAPT) has been shown to reduce the risk of early recurrent stroke in patients with high-grade stenosis. Intracranial stenosis is primarily due to atherosclerotic plaque buildup, leading to luminal narrowing and an increased risk for thromboembolism. In the setting of a small infarct (here described as a lacunar infarct) with severe MCA stenosis, the culprit lesion is likely due to branch occlusion from atherosclerotic disease. The patient with left-sided weakness and MRI findings of a right lacunar infarct, in conjunction with CTA showing severe right MCA stenosis, is at high risk for further ischemic events. This scenario requires medical management rather than procedural intervention in the acute phase. Diagnosis is achieved through MRI (confirming infarction) and CTA (demonstrating vascular stenosis). Differential diagnoses include cardioembolic stroke, other large vessel atherosclerotic strokes, or small vessel lipohyalinosis without significant stenosis. The comparative evaluation of imaging findings differentiates intracranial atherosclerotic disease from pure lacunar disease. Based on current guidelines and the SAMMPRIS trial, first-line management for symptomatic intracranial stenosis is aggressive medical therapy with dual antiplatelet treatment (typically aspirin plus clopidogrel) for a defined period along with intensive risk factor management (e.g., blood pressure, lipids, diabetes control). Stenting is generally reserved for cases refractory to medical therapy. In pregnant or lactating patients, antiplatelet choices may be modified; low-dose aspirin is acceptable, although clopidogrel use requires careful risk-benefit evaluation. Option A (ASA alone) may be insufficient to prevent recurrence in this high-risk scenario. Option B (IV thrombolysis) applies to acute ischemic stroke intervention but does not address the underlying intracranial stenosis once the acute event has passed. Option C (DAPT) is correct, as it aligns with current recommendations for managing symptomatic intracranial stenosis. Option D (Stent) is not the first-line treatment given that studies such as SAMMPRIS have shown that intensive medical management is superior to stenting in the initial management phase. 1. In symptomatic intracranial atherosclerosis, DAPT plays a crucial role in preventing early recurrent strokes. 2. Stenting is typically reserved for patients who have failed optimal medical management. Recent landmark trials, including SAMMPRIS, strongly support an initial management strategy of dual antiplatelet therapy combined with risk factor modification in cases of symptomatic intracranial stenosis.",
    "exam_year": "2024",
    "exam_type": "Part I"
  },
  {
    "question_text": "Patient came with history of vertigo, nausea DWI showed (image of brain MRI). Which of the following is correct?",
    "options": {
      "option_a": "Right side ptosis",
      "option_b": "Lt uvula deviation",
      "option_c": "Rt uvula deviation",
      "option_d": "is not provided.",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Posterior circulation strokes, particularly those affecting the brainstem, can produce a variety of cranial nerve deficits. Involvement of structures governing the soft palate, such as the nucleus ambiguus, leads to characteristic findings like uvular deviation. Infarction within the lateral medulla (Wallenberg syndrome) often affects the nucleus ambiguus or its associated fibers, which are responsible for the motor innervation of the palate via the vagus nerve (CN X). When these fibers are compromised on one side, the functioning opposite side exerts a greater pull on the soft palate, causing the uvula to deviate away from the side of the lesion. A patient presenting with vertigo and nausea is often experiencing a posterior circulation event. If the infarct involves the right lateral medulla, one might expect a right-sided weakness of the palatal muscles, resulting in uvular deviation toward the left. Other associated symptoms can include dysphagia, hoarseness, and ipsilateral Horner’s syndrome. Diffusion weighted imaging (DWI) is sensitive for detecting acute infarcts in the brainstem. Differential diagnoses include cerebellar infarcts, vestibular neuritis, and other brainstem syndromes. A careful neurological exam helps to distinguish the patterns; for example, uvular deviation typically indicates involvement of the vagal motor fibers. Acute management focuses on supportive treatment, secondary prevention with antithrombotic therapy, and aggressive risk factor modification. In pregnant or lactating patients, management follows similar principles, but medication choices (including antiplatelets) must consider fetal and neonatal safety. Rehabilitation for swallowing and speech may also be required. Option A (Right side ptosis) may be a feature of Horner’s syndrome seen in lateral medullary infarcts, but it is not the specific sign tested here. Option B (Left uvula deviation) is correct for a right-sided lesion affecting the nucleus ambiguus, as the palate deviates away from the affected side. Option C (Right uvula deviation) would imply a left-sided lesion. Option D is not provided. 1. In lesions affecting the nucleus ambiguus, the uvula deviates away from the side of the lesion. 2. Vertigo and nausea in a stroke patient should prompt evaluation of the posterior circulation and brainstem structures. Recent studies and guidelines continue to emphasize the importance of early recognition of posterior circulation strokes. Advanced imaging techniques have enhanced the diagnostic accuracy for brainstem infarcts, and multidisciplinary management remains the standard of care.",
    "exam_year": "2024",
    "exam_type": "Part I",
    "image_url": "page_15.png"
  },
  {
    "question_text": "70 YO, M, Came with this MRI.",
    "options": {
      "option_a": "Watershed",
      "option_b": "Cardioembolic",
      "option_c": "Small Vessle Disease",
      "option_d": "Vasculitis",
      "option_e": ""
    },
    "correct_answer": "A",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Watershed infarcts are a type of ischemic stroke that occur in the border zones between two major cerebral arterial territories (eg, between the anterior and middle cerebral arteries or between the middle and posterior cerebral arteries). They typically result from systemic hypoperfusion or severe carotid disease, leading to reduced blood flow in these vulnerable border regions. In watershed strokes, the distal fields of two arterial systems are most vulnerable to a drop in cerebral perfusion pressure. In elderly patients, chronic vascular disease or severe hypotension (or carotid occlusive disease) can lead to these borderzone infarcts. The compromised perfusion in these regions causes ischemia and infarction. Recent evidence underscores the importance of maintaining optimal hemodynamic stability, especially in patients with preexisting carotid disease. Patients with watershed infarcts may present with symptoms that correlate with the affected borderzone regions. For example, infarcts between the ACA and MCA territories can produce contralateral leg weakness and cognitive disturbances. In an elderly male with a history of vascular disease, an MRI showing a border-zone pattern supports a diagnosis of a watershed infarct. Diagnosis usually relies on neuroimaging (MRI is more sensitive than CT in the early phase). Differential diagnoses include: cardioembolic stroke (typically producing cortical infarcts in distinct vascular territories), small vessel (lacunar) infarcts which affect deep structures, and vasculitis which often produces multifocal, scattered lesions. History, risk factor assessment, and imaging characteristics help differentiate these conditions. Management focuses on correcting the underlying hemodynamic instability. First-line management involves optimizing blood flow, blood pressure control, and supportive care. Secondary prevention includes antiplatelet therapy, statins, and management of risk factors (hypertension, diabetes, etc.). In special populations such as pregnant or lactating women, careful selection of antihypertensives (eg, labetalol or nifedipine) and antiplatelet agents with safety profiles in pregnancy is essential. Option A (Watershed) is correct as the imaging is consistent with a border-zone pattern. Option B (Cardioembolic) is typically associated with abrupt cortical infarcts in distinct vascular distributions. Option C (Small Vessel Disease) usually gives lacunar infarcts in deep brain regions. Option D (Vasculitis) generally exhibits multifocal and irregular lesions rather than the classic border-zone pattern. 1. Watershed infarcts occur in areas where arterial territories meet (border zones) and are highly sensitive to drops in perfusion pressure. 2. Management requires strict control of blood pressure and risk factor modification. 3. Neuroimaging is crucial to differentiate watershed infarcts from other types of stroke. Recent studies emphasize the importance of perioperative and long‐term blood pressure management to prevent watershed infarctions in at-risk populations. Updated guidelines highlight the benefit of aggressive vascular risk factor management in elderly patients with carotid artery disease.",
    "exam_year": "2024",
    "exam_type": "Part I"
  },
  {
    "question_text": "Patient after severe external carotid stenosis revascularization, 1 day later found confused, CT brain (image shown), what is the mechanism.",
    "options": {
      "option_a": "hypoperfusion",
      "option_b": "Hyperperfusion",
      "option_c": "Autoregulation",
      "option_d": "Artery to artery",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Hyperperfusion syndrome is a recognized complication following procedures that restore blood flow, such as carotid revascularization. It results from an abrupt increase in cerebral blood flow to previously hypoperfused brain regions that have lost the ability to autoregulate. In chronic stenotic conditions, cerebral blood vessels adapt to low flow, leading to impaired autoregulation. When revascularization (eg, carotid endarterectomy or stenting) suddenly increases the blood supply, the cerebral arterioles cannot constrict adequately. This results in increased capillary pressure, breakdown of the blood-brain barrier, vasogenic edema, and sometimes even intracerebral hemorrhage. The mechanism is well-documented in cases following revascularization procedures. Patients typically present within hours to a few days after revascularization with symptoms such as headache, confusion, and sometimes seizures or focal deficits. In this case, confusion occurring one day post-procedure is highly suggestive of cerebral hyperperfusion syndrome. Clinical diagnosis is supported by imaging (CT or MRI), which may show cerebral edema or hemorrhage. Differential diagnoses include hypoperfusion infarcts (which would present with focal deficits and ischemic changes on imaging), embolic strokes (which often show territorial infarcts), and reperfusion injury. The time course and imaging findings help differentiate hyperperfusion syndrome from these conditions. The cornerstone of management is strict blood pressure control to prevent further increases in cerebral perfusion pressure. First-line treatment involves intravenous antihypertensives such as labetalol or nicardipine. Supportive care and close neurological monitoring are essential. In severe cases with cerebral edema, additional measures like osmotherapy may be required. In pregnant patients, labetalol and hydralazine are considered safe; similar caution applies during lactation with appropriate agent selection. Option A (Hypoperfusion) is incorrect as it would result in ischemic infarction rather than the edema seen in hyperperfusion syndrome. Option B (Hyperperfusion) is correct, as it best explains the sudden increase in blood flow following revascularization leading to edema and neurologic symptoms. Option C (Autoregulation) is a normal physiological process that is impaired in this scenario, and Option D (Artery to artery embolism) would typically result in territorial infarcts rather than the diffuse changes seen here. 1. Hyperperfusion syndrome typically manifests within 24-72 hours after carotid revascularization. 2. The key management step is aggressive blood pressure control to mitigate the risk of hemorrhage. 3. Recognition of the syndrome is critical to prevent further neurological deterioration. Current guidelines stress the importance of perioperative monitoring of blood pressure following revascularization procedures. Recent research has underscored that using intravenous antihypertensives early post-procedure reduces the incidence and severity of hyperperfusion syndrome.",
    "exam_year": "2024",
    "exam_type": "Part I"
  },
  {
    "question_text": "Patient has 2 stroke, sensory peripheral neuropathy, skin rash with picture. What is the enzyme involved in this disease.",
    "options": {
      "option_a": "Alpha-Galactosidase",
      "option_b": "",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "A",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Fabry disease is an X-linked lysosomal storage disorder characterized by a deficiency in the enzyme alpha-galactosidase A. This enzyme deficiency leads to the accumulation of glycosphingolipids, particularly globotriaosylceramide, in various tissues throughout the body. The deficiency of alpha-galactosidase A results in the deposition of glycosphingolipids in the endothelial cells of blood vessels, the nervous system, kidneys, and skin. This accumulation can lead to vascular dysfunction, pain in the extremities (acroparesthesias), and organ damage. The stroke, neuropathy, and characteristic skin findings (angiokeratomas) seen in Fabry disease correlate with the widespread vascular deposition and subsequent tissue ischemia and inflammation. Patients with Fabry disease often present with a combination of clinical features such as early-onset strokes, peripheral neuropathy (manifesting as burning pain in the hands and feet), and angiokeratomas (small, reddish-purple skin lesions). These signs are crucial for the clinical diagnosis of the disorder. Diagnosis is confirmed by measuring alpha-galactosidase A activity in leukocytes or plasma, with genetic testing to identify mutations in the GLA gene. Differential diagnoses include other lysosomal storage disorders (such as Gaucher's disease) and conditions causing stroke in young adults. The pattern of multisystem involvement with characteristic skin lesions and neuropathic pain assists in differentiating Fabry disease from other disorders. Management includes enzyme replacement therapy (ERT) with agents such as agalsidase beta or agalsidase alfa to reduce glycosphingolipid accumulation. Adjunctive therapies involve pain management, management of renal involvement, and cardiovascular risk reduction. For pregnant or lactating women, the use of ERT requires careful discussion with specialists because data are limited; however, individualized management is recommended with close monitoring. Option A (Alpha-Galactosidase) is correct, as the enzyme deficient in Fabry disease is alpha-galactosidase A. The other options were not provided, but based on the clinical scenario the correct enzyme is clearly indicated. 1. Fabry disease can present with strokes at a younger age compared to typical atherosclerotic disease. 2. Angiokeratomas (small, dark red telangiectatic skin lesions) are a hallmark of the disease. 3. Early diagnosis and intervention with ERT can slow disease progression. Recent studies highlight the benefits of early enzyme replacement therapy in Fabry disease to delay the progression of organ damage. Guidelines now recommend family screening and genetic counseling for early identification and management of the condition.",
    "exam_year": "2024",
    "exam_type": "Part I",
    "image_url": "https://drive.google.com/file/d/1EeHee6W2qvJjiZZi93bMjfVtfpclDJpE/preview"
  },
  {
    "question_text": "Case of Sturge Weber (hint: bort wine on face) asked about what it comes with.",
    "options": {
      "option_a": "Renal Angiofibroma",
      "option_b": "Cardiac Rhabdomyosarcoma",
      "option_c": "Glaucoma",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "C",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Sturge-Weber syndrome is a neurocutaneous disorder characterized by a facial capillary malformation (commonly known as a port-wine stain) along the distribution of the trigeminal nerve, leptomeningeal angiomas, and associated ocular abnormalities. The syndrome is thought to arise from a somatic mosaic mutation in the GNAQ gene, leading to abnormal vascular development. The port-wine stain is due to capillary malformations in the skin, and the leptomeningeal angiomas can lead to seizures and neurological deficits. The ocular involvement, particularly glaucoma, is due to increased episcleral venous pressure and abnormal vascular development in the eye. Patients with Sturge-Weber syndrome typically present with a port-wine stain (often described as a 'port wine' or 'bordeaux wine' appearance) on the face, usually in the V1 distribution of the trigeminal nerve. Glaucoma is a common complication and can lead to vision loss if not managed appropriately. Neurological symptoms such as seizures may also be present due to leptomeningeal angiomatosis. Diagnosis is primarily clinical based on the characteristic cutaneous and neurological findings. Neuroimaging (MRI/CT) can help identify leptomeningeal angiomas, and ophthalmologic evaluation is essential for early detection of glaucoma. Differential diagnoses include other phakomatoses like Klippel-Trenaunay syndrome, but the combination of facial port-wine stain and leptomeningeal involvement is specific for Sturge-Weber. Management is multidisciplinary. Seizures are managed with antiepileptic medications with careful consideration in pregnant and lactating patients (eg, lamotrigine or levetiracetam, which have relatively favorable profiles). Glaucoma management is crucial and may include topical medications like beta-blockers (with caution in pregnancy, where agents like timolol require careful risk assessment) or surgical interventions if medical therapy fails. Regular ophthalmologic and neurological monitoring is advised. Option A (Renal Angiofibroma) is incorrect as it is not a feature of Sturge-Weber syndrome. Option B (Cardiac Rhabdomyosarcoma) is unrelated to the syndrome. Option C (Glaucoma) is correct because glaucoma is a well-known ocular complication associated with Sturge-Weber syndrome. 1. The port-wine stain in Sturge-Weber syndrome is typically unilateral and follows the distribution of the trigeminal nerve. 2. Glaucoma is a common complication and can develop in early childhood or later in life. 3. Early and regular ophthalmologic evaluations are critical to prevent vision loss. Recent research and clinical guidelines emphasize early recognition and intervention for glaucoma in Sturge-Weber patients. Advances in neuroimaging and genetic testing have improved the understanding of the underlying molecular mechanisms, aiding in more tailored management approaches.",
    "exam_year": "2024",
    "exam_type": "Part I"
  },
  {
    "question_text": "A patient in the clinic he has continuous facial jerk and hand jerk (partials continua) how to treat:",
    "options": {
      "option_a": "iv valproic acid",
      "option_b": "iv diazepam",
      "option_c": "iv phenytoin",
      "option_d": "iv ……",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question addresses a type of focal status epilepticus – continuous partial motor seizures (epilepsia partialis continua) – where abnormal electrical activity leads to repetitive jerking in specific muscle groups (e.g., face and hand). The immediate goal in management is to terminate the seizure activity, and benzodiazepines are the first‐line agents for status epilepticus. In status epilepticus, there is prolonged, unremitting neuronal firing. This occurs because inhibitory GABAergic mechanisms become impaired and excitatory activity becomes dominant. IV benzodiazepines (such as diazepam) enhance GABA-A receptor activity, helping to restore inhibitory tone and rapidly abort seizure activity. With continued seizures, receptor trafficking may render the seizures more refractory, which underpins the urgency of early intervention. A patient with continuous facial and hand jerks is manifesting focal seizure activity. This focal status—despite being limited to specific regions—can evolve and cause structural injury if not controlled promptly. Recognizing the pattern and rapidly instituting therapy is key to preventing worsening neuronal injury. Diagnosis is primarily clinical though EEG confirmation is important if the diagnosis is in doubt. Differential diagnoses include epilepsia partialis continua secondary to structural lesions (e.g., stroke, tumor or infection) and non-epileptic movement disorders. Imaging (CT/MRI) helps evaluate for structural causes, while EEG confirms ongoing epileptiform activity. The latest guidelines (e.g., from the Neurocritical Care Society and ILAE) recommend immediate treatment of status epilepticus. First‐line management is IV benzodiazepines (diazepam, lorazepam) due to their rapid onset. If seizures persist, second‐line agents such as fosphenytoin, valproic acid, or levetiracetam are considered. In special populations such as pregnant or lactating women, the risks of fetal exposure to benzodiazepines (potential for fetal sedation, withdrawal) are weighed against the emergent need to control seizures, and therapy is individualized. Option A (IV valproic acid) is recognized as a second-line option once benzodiazepines have been tried. Option B (IV diazepam) fits the first-line recommendation for acute seizure termination. Option C (IV phenytoin) is also generally used as a second-line agent. Option D is incomplete. Therefore, Option B is the correct initial treatment. • In status epilepticus, prompt administration of benzodiazepines is critical, as delays increase morbidity and mortality.  • Recognize that focal status epilepticus may be due to an underlying lesion; work-up should include neuroimaging. Recent evidence continues to support benzodiazepines as the first-line treatment in all forms of status epilepticus, with multiple guidelines emphasizing rapid administration to improve outcomes. Research is also ongoing concerning the optimal sequencing and combination of second-line agents.",
    "exam_year": "2020",
    "exam_type": "Part II"
  },
  {
    "question_text": "Patient with large left ICA territory infarction with image of CT shown (massive acute infarction), was found to have AFIB what is the appropriate treatment next to start:",
    "options": {
      "option_a": "Aspirin",
      "option_b": "DAPT",
      "option_c": "dabigatran",
      "option_d": "warfarin",
      "option_e": ""
    },
    "correct_answer": "A",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question involves the acute management of a patient with a large left internal carotid territory infarction in the setting of atrial fibrillation (AF). AF is a common cause of cardioembolic stroke. However, in the setting of a massive infarct, the risk of hemorrhagic transformation must be carefully balanced against the benefits of anticoagulation. In patients with AF, emboli originating from the left atrium can lodge in the cerebral circulation (typically the ICA territory), leading to large infarctions. A massive infarct increases the risk of blood–brain barrier disruption and hemorrhagic conversion, which can be exacerbated by early full-dose anticoagulation. The CT showing a massive infarction indicates extensive brain tissue damage. Although AF typically mandates long-term anticoagulation for secondary stroke prevention, immediate initiation post-large infarct could precipitate hemorrhagic transformation. Thus, initial management with an antiplatelet agent is often preferred until the infarct stabilizes. Management begins with neuroimaging (CT/MRI) to assess infarct size and exclude hemorrhage, followed by cardiac evaluation (ECG, echocardiogram) for AF. Differential diagnoses include large artery atherosclerosis and lacunar strokes; however, the presence of AF shifts the etiology toward a cardioembolic source. For massive infarctions in patients with AF, current guidelines (AHA/ASA) recommend delaying full-dose anticoagulation by 1–2 weeks to reduce the risk of hemorrhagic transformation. In the acute phase, low-dose aspirin is used for antithrombotic therapy. When transitioning to long-term stroke prevention, direct oral anticoagulants (DOACs; e.g., dabigatran) or warfarin are considered, with DOACs often preferred in non-pregnant adults. For pregnant patients, warfarin is contraindicated, and low-molecular-weight heparin is often chosen, whereas lactating patients may use warfarin safely with monitoring. Option A (Aspirin) is correct as the immediate treatment to bridge the patient while delaying anticoagulation. Option B (Dual antiplatelet therapy) is generally not indicated for cardioembolic strokes. Options C (dabigatran) and D (warfarin) represent long-term anticoagulation strategies but are not initiated immediately in the context of a massive infarct due to the heightened hemorrhagic risk. • In cardioembolic strokes due to AF, full anticoagulation is essential for secondary prevention but must be timed appropriately after a large infarct.  • Massive infarcts require cautious initiation of any antithrombotic therapy to prevent hemorrhagic transformation. Current research and recent guideline updates recommend a delayed approach to anticoagulation in large infarcts, highlighting the safety benefit of initial antiplatelet therapy (aspirin) before transitioning to full anticoagulation. Ongoing studies continue to refine the optimum timing balance between reducing recurrence and avoiding hemorrhage.",
    "exam_year": "2020",
    "exam_type": "Part II"
  },
  {
    "question_text": "SCA artery infarction scenario what you will find also:",
    "options": {
      "option_a": "Rt. ptosis Ipsilateral",
      "option_b": "",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question pertains to identifying additional clinical findings associated with a Superior Cerebellar Artery (SCA) infarction. SCA strokes typically affect structures of the cerebellum, leading to deficits in coordination and balance. The superior cerebellar artery supplies the superior aspect of the cerebellum, including regions responsible for coordinating limb movements and maintaining balance. Infarction in this territory can cause degeneration or dysfunction of the cerebellar cortex and deep nuclei, leading to ipsilateral cerebellar deficits. Patients with SCA infarction may present with ipsilateral limb dysmetria, ataxia, dysdiadochokinesia (impaired ability to perform rapid alternating movements), and sometimes vertigo or nausea. These symptoms help differentiate the infarct from involvement of other cerebellar territories. Diagnosis is made via neuroimaging (MRI is more sensitive than CT for posterior fossa strokes) and clinical examination. Differentiation from infarctions in other cerebellar arterial territories, like the Anterior Inferior Cerebellar Artery (AICA) or Posterior Inferior Cerebellar Artery (PICA), rests on subtle differences in the clinical presentation – for example, AICA infarcts may also involve facial nerve findings, while PICA infarcts are associated with lateral medullary (Wallenberg) syndrome. Management of an SCA stroke follows guidelines for acute ischemic stroke, including potential thrombolysis if within the therapeutic window, supportive care, and monitoring for complications such as cerebellar edema that could cause brainstem compression. In pregnant women, thrombolysis can be used if indicated after careful risk–benefit analysis, and similar principles apply during lactation with attention to medication safety profiles. Although the option texts are incomplete in this question, Option A mentions “Rt. ptosis Ipsilateral” which is more suggestive of an oculomotor or midbrain involvement rather than a cerebellar syndrome. Option B is the marked answer and, based on classical SCA infarct presentations, likely represents clinical signs such as ipsilateral cerebellar ataxia and dysmetria. Without the full list, we assume Option B correctly identifies the typical cerebellar findings seen in SCA infarction. • SCA infarctions classically produce ipsilateral cerebellar deficits rather than cranial nerve III findings (such as ptosis).  • A careful clinical examination paired with posterior fossa imaging is crucial in localizing cerebellar strokes. The latest imaging techniques (especially diffusion-weighted MRI) have improved the detection of cerebellar infarcts. Recent stroke guidelines also emphasize a tailored approach to managing posterior circulation strokes, including vigilant monitoring for complications like brainstem compression in cerebellar infarctions.",
    "exam_year": "2020",
    "exam_type": "Part II"
  },
  {
    "question_text": "30 y/o male found unconscious at street What you expect as the mechanism of injury for attached CT (looked like coup countercoup bleed \"repeated question from previous exam\")",
    "options": {
      "option_a": "Aneurysmal",
      "option_b": "Trauma",
      "option_c": "HTN",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question highlights a scenario with a 30‐year‐old male found unconscious and a CT scan showing a lesion that resembles a coup–countercoup injury. Coup–countercoup injuries are a type of traumatic brain injury (TBI) resulting from blunt force trauma. In coup–countercoup injuries, the brain is injured at the site of impact (coup) and on the opposite side (countercoup) due to the brain's movement within the skull. The rapid deceleration forces generate contusions and bruising, which can lead to intracranial hemorrhage and edema. The patient’s presentation (unconsciousness) combined with CT findings consistent with a coup–countercoup injury points to a trauma-related mechanism. This distinguishes it from aneurysmal bleeds (which usually present with subarachnoid hemorrhage) or hypertensive hemorrhages (which typically affect deep brain structures in older individuals). Diagnosis is established with neuroimaging (CT scan being the first-line modality in acute trauma). Differential diagnoses include aneurysmal subarachnoid hemorrhage and hypertensive intracerebral hemorrhage; however, the imaging pattern and patient profile (young age, history of trauma) point toward a traumatic cause. Management of traumatic brain injury includes stabilization of airway, breathing, and circulation (the ABCs), followed by neuroimaging and neurosurgical evaluation. Intracranial pressure monitoring and supportive care are key components. For pregnant patients, while imaging with CT is generally avoided when possible due to radiation concerns, if necessary, appropriate shielding is used. The same management principles apply with heightened caution. Option A (Aneurysmal) is incorrect as aneurysmal bleeds produce a different pattern (typically subarachnoid hemorrhage) and are less common in a young trauma patient. Option B (Trauma) is the correct answer, accurately reflecting the coup–countercoup injury mechanism. Option C (Hypertension) is unlikely in a 30-year-old with traumatic findings and would more typically produce deep hemorrhages in older patients. • Coup–countercoup injuries result from inertial forces that damage both the site of impact and the opposite side; always consider trauma in young patients with such CT findings.  • Rapid identification and management of TBI are critical to prevent secondary brain injury. Recent guidelines on traumatic brain injury emphasize early recognition, stabilization, and neuroimaging. Advances in CT technology have improved the early detection of coup–countercoup lesions, and current management protocols stress the importance of monitoring intracranial pressure and using neuroprotective strategies where appropriate.",
    "exam_year": "2020",
    "exam_type": "Part II"
  },
  {
    "question_text": "A female who develops transverse sinus thrombosis what is the most accurate statement to describe this patient",
    "options": {
      "option_a": "female sex is a major risk",
      "option_b": "seizure is the most common presenting symptoms",
      "option_c": "transverse sinus is the most commonly affected sinus in CVT",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "A",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Cerebral venous thrombosis (CVT) is a condition characterized by clot formation in the dural venous sinuses. It disproportionately affects women, largely due to risk factors such as oral contraceptive use, pregnancy, and the postpartum period. In CVT, thrombosis occurs in one or more of the dural venous sinuses resulting in impaired venous drainage, increased intracranial pressure, and possibly venous infarctions or hemorrhages. Hypercoagulable states, frequently encountered in females (e.g., due to estrogen exposure), play a central role. Patients often present with headache (the most common symptom), focal neurological deficits, seizures, and signs of raised intracranial pressure. Although seizures may occur, they are not the predominant presenting feature. The strong female preponderance is a critical clue in the clinical scenario. Diagnosis is made with neuroimaging studies such as magnetic resonance imaging (MRI) combined with magnetic resonance venography (MRV). Differentials include migraines, meningitis, intracerebral hemorrhage, and subarachnoid hemorrhage, but the clinical context along with imaging aids in differentiation. First-line management involves anticoagulation with low molecular weight heparin (LMWH) even in cases with hemorrhagic transformation. In pregnancy and lactation, LMWH is preferred due to its safety profile. Subsequent management includes transitioning to oral anticoagulants with appropriate monitoring and risk factor modification. Option A (female sex is a major risk) is correct, as women are indeed at higher risk due to hormonal factors and related hypercoagulable states. Option B is incorrect because, although seizures can occur, headache remains the most common presenting symptom. Option C, while noting that the transverse sinus is a common site, is less accurate as literature variably points to both the superior sagittal and transverse sinuses; moreover, the emphasis on female risk makes option A more specific in this context. 1. Always assess for prothrombotic risk factors in women with CVT. 2. Headache is the most common presenting symptom in CVT. 3. Early anticoagulation is key to reducing morbidity. Recent guidelines and research from the American Heart Association (AHA) endorse prompt anticoagulation in CVT. Studies continue to clarify which sinus is most commonly involved, yet the strong female predisposition remains universally acknowledged.",
    "exam_year": "2020",
    "exam_type": "Part II"
  }
]