[
  {
    "question_text": "Case scenario of patient with new onset slurred speech and left sided weakness. Symptoms started in the morning, he came to ER in the evening. Brain CT: right hemispheric stroke. BP was 180/95 mmHg. What is the best next step for BP control?",
    "options": {
      "option_a": "IV Hydralazine",
      "option_b": "IV Labetalol",
      "option_c": "No intervention needed",
      "option_d": "Oral Amlodipine",
      "option_e": ""
    },
    "correct_answer": "C",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Acute ischemic stroke is frequently accompanied by a stress-related elevation in blood pressure. Permissive hypertension is a well‐recognized compensatory mechanism to maintain cerebral perfusion in the ischemic penumbra. After an ischemic stroke, cerebral autoregulation may be impaired. The elevated blood pressure helps maintain blood flow to the ischemic regions. Aggressive blood pressure reduction could diminish perfusion to these vulnerable areas, potentially expanding the infarct. This patient’s blood pressure of 180/95 mmHg is below the thresholds (typically >220/120 mmHg in non-thrombolysed patients) at which immediate pharmacologic lowering is indicated. His presentation, with a right hemispheric infarct on CT and onset several hours earlier, fits the picture where blood pressure is allowed to remain elevated. In acute stroke, the differential for hypertension includes a stress response to stroke versus pre-existing chronic hypertension. Blood pressure is carefully monitored and only managed if it exceeds thresholds or if the patient is a candidate for thrombolytic therapy (which requires lower BP). Current guidelines recommend not lowering the blood pressure acutely in ischemic stroke patients who are not candidates for thrombolysis, unless systolic BP is >220 mmHg or diastolic BP is >120 mmHg. In pregnant or lactating patients, similar thresholds apply, with careful selection of antihypertensive agents when required. The best approach is often supportive management rather than aggressive BP reduction. Option A (IV Hydralazine) and Option B (IV Labetalol) are antihypertensives that are used if blood pressure exceeds safety thresholds or in patients undergoing thrombolysis. Option D (Oral Amlodipine) is not appropriate in the acute management phase due to its slower onset. Hence, Option C (No intervention needed) is correct given the patient’s BP relative to guideline thresholds. 1. Permissive hypertension in acute ischemic stroke is critical to maintaining perfusion in the ischemic penumbra. 2. Only in patients eligible for thrombolysis or with severely elevated pressures should BP lowering be initiated acutely. Recent stroke guidelines continue to support a strategy of permissive hypertension in the absence of thrombolysis, emphasizing that overzealous BP lowering may worsen outcomes by reducing perfusion in the ischemic brain.",
    "exam_year": "2022",
    "exam_type": "Part I",
    "image_url": "page_3.png"
  },
  {
    "question_text": "Case scenario of patient with symptomatic ICA stenosis. He underwent carotid endarterectomy. Few days later developed new onset confusion and decreased level of consciousness. Urgent brain CT attached. What could explain his current condition?",
    "options": {
      "option_a": "Malignant MCA transformation",
      "option_b": "Cerebral venous thrombosis",
      "option_c": "Hyperperfusion",
      "option_d": "provided.",
      "option_e": ""
    },
    "correct_answer": "A",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Cerebral hyperperfusion syndrome (CHS) is a recognized complication following carotid endarterectomy. It results from a sudden increase in blood flow in cerebral territories that have lost their autoregulatory capacity due to chronic hypoperfusion. In patients with severe carotid stenosis, cerebral vessels distal to the stenosis are chronically dilated to maintain perfusion. After revascularization, these vessels may not be able to constrict appropriately, leading to hyperperfusion. This may result in cerebral edema, hemorrhage, and neurologic deterioration, which explains the patient’s confusion and decreased level of consciousness. The onset of symptoms a few days after carotid endarterectomy, in a patient with prior symptomatic ICA stenosis, is highly suggestive of CHS rather than thromboembolic events. The clinical picture of altered mental status corresponds with the expected manifestations of hyperperfusion-induced brain injury. Diagnosis is made clinically, supplemented by imaging studies. CT or MRI may show cerebral edema or even hemorrhage in severe cases, differentiating CHS from other complications such as thromboembolic stroke or malignant MCA infarction. Differential diagnoses include malignant middle cerebral artery (MCA) infarction and cerebral venous thrombosis, but the timing (post-endarterectomy) fits best with hyperperfusion. Management involves careful blood pressure control to mitigate the risk and severity of hyperperfusion. First-line management includes tight BP control using short-acting intravenous antihypertensives (e.g., labetalol or nicardipine), along with supportive care. In pregnant or lactating patients who undergo carotid procedures (rare), BP management must consider fetal safety, often using agents with well-established safety profiles. Monitoring in an intensive care setting is typically required, and early recognition is paramount to prevent intracerebral hemorrhage. Option A (Malignant MCA transformation) usually presents with significant mass effect and midline shift; Option B (Cerebral venous thrombosis) has a different clinical and radiologic profile; Option C (Hyperperfusion) is correct as it exactly explains the post-operative scenario. There was no Option D provided. 1. After carotid endarterectomy, new neurological deficits with altered mental status should raise the suspicion for cerebral hyperperfusion syndrome. 2. Prevention by meticulous blood pressure control post-surgery is key to reducing the incidence of CHS. Recent literature supports the use of strict blood pressure management protocols post-carotid revascularization to prevent CHS. Updated guidelines underscore the importance of early detection and management, utilizing continuous BP monitoring and rapidly titratable antihypertensive agents.",
    "exam_year": "2022",
    "exam_type": "Part I",
    "image_url": "page_3.png"
  },
  {
    "question_text": "Scenario of acute ischemic stroke, started on IV tPA, 30 minutes later he has headache, vomiting, lethargy, BP 180/100 mmHg. What is the best next step?",
    "options": {
      "option_a": "Brain CT",
      "option_b": "Stop tPA",
      "option_c": "IV Labetalol",
      "option_d": "Close observation",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question tests the recognition and prompt management of a hemorrhagic complication during intravenous thrombolytic therapy (IV tPA) for acute ischemic stroke. The clinical scenario is designed to alert you to the signs of a potential intracerebral hemorrhage developing soon after tPA administration. tPA works by promoting fibrinolysis to dissolve clots; however, it also disrupts the blood–brain barrier and local hemostasis. In some patients, especially when blood pressures are high or vessel integrity is compromised, this can lead to a hemorrhagic transformation. The sudden onset of headache, vomiting, and lethargy, along with an elevation in blood pressure, are red flags for intracranial bleeding. The patient’s neurologic deterioration (lethargy) combined with symptoms of increased intracranial pressure (headache, vomiting) soon after commencement of tPA strongly suggests a hemorrhagic complication. The elevated blood pressure further increases the risk of bleeding. It is essential to act immediately to prevent further hemorrhage. In suspected hemorrhagic transformation post-tPA, the immediate step is to stop the tPA infusion to prevent additional thrombolysis and ongoing bleeding. This is then followed by emergent neuroimaging—typically a noncontrast CT scan—to confirm the presence and extent of intracerebral hemorrhage. Differential diagnoses might include reperfusion injury or a stroke progression, but the clinical picture here is most consistent with hemorrhage. Immediate management involves: 1) Stopping the tPA infusion to prevent further bleeding, 2) Urgently obtaining a noncontrast CT scan to confirm hemorrhage, 3) If hemorrhage is confirmed, initiating measures to reverse the fibrinolytic state (commonly via administration of cryoprecipitate or antifibrinolytics) and controlling blood pressure. Guidelines recommend rapidly discontinuing tPA when intracranial hemorrhage is suspected. In pregnant or lactating patients, while imaging (CT scan) is still indicated, appropriate shielding and risk/benefit discussion should be undertaken. • Option A (Brain CT): Although CT imaging is essential, it is not the very first step because the tPA infusion must be halted immediately to avoid further bleeding. \\n• Option B (Stop tPA): This is correct since the immediate cessation of thrombolytic therapy is the highest priority upon suspicion of hemorrhage. \\n• Option C (IV Labetalol): While blood pressure control is important, using antihypertensives before stopping tPA does not address the ongoing thrombolytic effect. \\n• Option D (Close observation): Observation is insufficient given the high risk of a life‐threatening hemorrhage; immediate intervention is required. • Any neurological deterioration or signs of raised intracranial pressure during tPA infusion should prompt immediate discontinuation of the drug. \\n• Elevated BP and symptoms such as headache and vomiting in this setting are highly suspicious for intracerebral hemorrhage. Recent American Heart Association/American Stroke Association guidelines stress the importance of rapid recognition and management of tPA-induced hemorrhagic complications. Immediate cessation of tPA is universally recommended, followed by urgent neuroimaging to verify the diagnosis and allow for timely intervention.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "Direct case scenario of thunderclap headache, CT shows subarachnoid bleed. CTA identified PCom artery aneurysm. Patient is medically free in her 40s. What is the best intervention?",
    "options": {
      "option_a": "Endovascular coiling",
      "option_b": "Surgical clipping",
      "option_c": "Annual follow up",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question tests the recognition and prompt management of a hemorrhagic complication during intravenous thrombolytic therapy (IV tPA) for acute ischemic stroke. The clinical scenario is designed to alert you to the signs of a potential intracerebral hemorrhage developing soon after tPA administration. tPA works by promoting fibrinolysis to dissolve clots; however, it also disrupts the blood–brain barrier and local hemostasis. In some patients, especially when blood pressures are high or vessel integrity is compromised, this can lead to a hemorrhagic transformation. The sudden onset of headache, vomiting, and lethargy, along with an elevation in blood pressure, are red flags for intracranial bleeding. The patient’s neurologic deterioration (lethargy) combined with symptoms of increased intracranial pressure (headache, vomiting) soon after commencement of tPA strongly suggests a hemorrhagic complication. The elevated blood pressure further increases the risk of bleeding. It is essential to act immediately to prevent further hemorrhage. In suspected hemorrhagic transformation post-tPA, the immediate step is to stop the tPA infusion to prevent additional thrombolysis and ongoing bleeding. This is then followed by emergent neuroimaging—typically a noncontrast CT scan—to confirm the presence and extent of intracerebral hemorrhage. Differential diagnoses might include reperfusion injury or a stroke progression, but the clinical picture here is most consistent with hemorrhage. Immediate management involves: 1) Stopping the tPA infusion to prevent further bleeding, 2) Urgently obtaining a noncontrast CT scan to confirm hemorrhage, 3) If hemorrhage is confirmed, initiating measures to reverse the fibrinolytic state (commonly via administration of cryoprecipitate or antifibrinolytics) and controlling blood pressure. Guidelines recommend rapidly discontinuing tPA when intracranial hemorrhage is suspected. In pregnant or lactating patients, while imaging (CT scan) is still indicated, appropriate shielding and risk/benefit discussion should be undertaken. • Option A (Brain CT): Although CT imaging is essential, it is not the very first step because the tPA infusion must be halted immediately to avoid further bleeding. \\n• Option B (Stop tPA): This is correct since the immediate cessation of thrombolytic therapy is the highest priority upon suspicion of hemorrhage. \\n• Option C (IV Labetalol): While blood pressure control is important, using antihypertensives before stopping tPA does not address the ongoing thrombolytic effect. \\n• Option D (Close observation): Observation is insufficient given the high risk of a life‐threatening hemorrhage; immediate intervention is required. • Any neurological deterioration or signs of raised intracranial pressure during tPA infusion should prompt immediate discontinuation of the drug. \\n• Elevated BP and symptoms such as headache and vomiting in this setting are highly suspicious for intracerebral hemorrhage. Recent American Heart Association/American Stroke Association guidelines stress the importance of rapid recognition and management of tPA-induced hemorrhagic complications. Immediate cessation of tPA is universally recommended, followed by urgent neuroimaging to verify the diagnosis and allow for timely intervention.",
    "exam_year": "2022",
    "exam_type": "Part I",
    "image_url": "page_3.png"
  },
  {
    "question_text": "Scenario of 65 years old male with multiple cardiovascular risk factors and afib, with 1 day history of right sided dense plegia and aphasia. His brain CT attached. Clinically he is lethargic and poorly communicating. Best next treatment option to consider?",
    "options": {
      "option_a": "Anticoagulation",
      "option_b": "Osmotic therapy",
      "option_c": "Craniotomy/decompression",
      "option_d": "Aspirin",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question tests the recognition and prompt management of a hemorrhagic complication during intravenous thrombolytic therapy (IV tPA) for acute ischemic stroke. The clinical scenario is designed to alert you to the signs of a potential intracerebral hemorrhage developing soon after tPA administration. tPA works by promoting fibrinolysis to dissolve clots; however, it also disrupts the blood–brain barrier and local hemostasis. In some patients, especially when blood pressures are high or vessel integrity is compromised, this can lead to a hemorrhagic transformation. The sudden onset of headache, vomiting, and lethargy, along with an elevation in blood pressure, are red flags for intracranial bleeding. The patient’s neurologic deterioration (lethargy) combined with symptoms of increased intracranial pressure (headache, vomiting) soon after commencement of tPA strongly suggests a hemorrhagic complication. The elevated blood pressure further increases the risk of bleeding. It is essential to act immediately to prevent further hemorrhage. In suspected hemorrhagic transformation post-tPA, the immediate step is to stop the tPA infusion to prevent additional thrombolysis and ongoing bleeding. This is then followed by emergent neuroimaging—typically a noncontrast CT scan—to confirm the presence and extent of intracerebral hemorrhage. Differential diagnoses might include reperfusion injury or a stroke progression, but the clinical picture here is most consistent with hemorrhage. Immediate management involves: 1) Stopping the tPA infusion to prevent further bleeding, 2) Urgently obtaining a noncontrast CT scan to confirm hemorrhage, 3) If hemorrhage is confirmed, initiating measures to reverse the fibrinolytic state (commonly via administration of cryoprecipitate or antifibrinolytics) and controlling blood pressure. Guidelines recommend rapidly discontinuing tPA when intracranial hemorrhage is suspected. In pregnant or lactating patients, while imaging (CT scan) is still indicated, appropriate shielding and risk/benefit discussion should be undertaken. • Option A (Brain CT): Although CT imaging is essential, it is not the very first step because the tPA infusion must be halted immediately to avoid further bleeding. \\n• Option B (Stop tPA): This is correct since the immediate cessation of thrombolytic therapy is the highest priority upon suspicion of hemorrhage. \\n• Option C (IV Labetalol): While blood pressure control is important, using antihypertensives before stopping tPA does not address the ongoing thrombolytic effect. \\n• Option D (Close observation): Observation is insufficient given the high risk of a life‐threatening hemorrhage; immediate intervention is required. • Any neurological deterioration or signs of raised intracranial pressure during tPA infusion should prompt immediate discontinuation of the drug. \\n• Elevated BP and symptoms such as headache and vomiting in this setting are highly suspicious for intracerebral hemorrhage. Recent American Heart Association/American Stroke Association guidelines stress the importance of rapid recognition and management of tPA-induced hemorrhagic complications. Immediate cessation of tPA is universally recommended, followed by urgent neuroimaging to verify the diagnosis and allow for timely intervention.",
    "exam_year": "2022",
    "exam_type": "Part I",
    "image_url": "page_3.png"
  },
  {
    "question_text": "Elderly female admitted with stroke. Attached her brain MRI. What else you will find?",
    "options": {
      "option_a": "Left Horner syndrome",
      "option_b": "Left facial sensory loss",
      "option_c": "Left uvula deviation",
      "option_d": "Facial nerve palsy",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question tests the recognition and prompt management of a hemorrhagic complication during intravenous thrombolytic therapy (IV tPA) for acute ischemic stroke. The clinical scenario is designed to alert you to the signs of a potential intracerebral hemorrhage developing soon after tPA administration. tPA works by promoting fibrinolysis to dissolve clots; however, it also disrupts the blood–brain barrier and local hemostasis. In some patients, especially when blood pressures are high or vessel integrity is compromised, this can lead to a hemorrhagic transformation. The sudden onset of headache, vomiting, and lethargy, along with an elevation in blood pressure, are red flags for intracranial bleeding. The patient’s neurologic deterioration (lethargy) combined with symptoms of increased intracranial pressure (headache, vomiting) soon after commencement of tPA strongly suggests a hemorrhagic complication. The elevated blood pressure further increases the risk of bleeding. It is essential to act immediately to prevent further hemorrhage. In suspected hemorrhagic transformation post-tPA, the immediate step is to stop the tPA infusion to prevent additional thrombolysis and ongoing bleeding. This is then followed by emergent neuroimaging—typically a noncontrast CT scan—to confirm the presence and extent of intracerebral hemorrhage. Differential diagnoses might include reperfusion injury or a stroke progression, but the clinical picture here is most consistent with hemorrhage. Immediate management involves: 1) Stopping the tPA infusion to prevent further bleeding, 2) Urgently obtaining a noncontrast CT scan to confirm hemorrhage, 3) If hemorrhage is confirmed, initiating measures to reverse the fibrinolytic state (commonly via administration of cryoprecipitate or antifibrinolytics) and controlling blood pressure. Guidelines recommend rapidly discontinuing tPA when intracranial hemorrhage is suspected. In pregnant or lactating patients, while imaging (CT scan) is still indicated, appropriate shielding and risk/benefit discussion should be undertaken. • Option A (Brain CT): Although CT imaging is essential, it is not the very first step because the tPA infusion must be halted immediately to avoid further bleeding. \\n• Option B (Stop tPA): This is correct since the immediate cessation of thrombolytic therapy is the highest priority upon suspicion of hemorrhage. \\n• Option C (IV Labetalol): While blood pressure control is important, using antihypertensives before stopping tPA does not address the ongoing thrombolytic effect. \\n• Option D (Close observation): Observation is insufficient given the high risk of a life‐threatening hemorrhage; immediate intervention is required. • Any neurological deterioration or signs of raised intracranial pressure during tPA infusion should prompt immediate discontinuation of the drug. \\n• Elevated BP and symptoms such as headache and vomiting in this setting are highly suspicious for intracerebral hemorrhage. Recent American Heart Association/American Stroke Association guidelines stress the importance of rapid recognition and management of tPA-induced hemorrhagic complications. Immediate cessation of tPA is universally recommended, followed by urgent neuroimaging to verify the diagnosis and allow for timely intervention.",
    "exam_year": "2022",
    "exam_type": "Part I",
    "image_url": "page_3.png"
  },
  {
    "question_text": "They brought the same scenario in question 28, but they added that: symptoms start to improve, she became following the commands but still has mild weakness and dysarthria. Next step?",
    "options": {
      "option_a": "IV tPA",
      "option_b": "Brain CTA",
      "option_c": "Thrombectomy",
      "option_d": "Dual antiplatelets",
      "option_e": ""
    },
    "correct_answer": "D",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "In acute ischemic stroke management, the severity of deficits is critical in guiding therapy. Patients with minor, non‐disabling deficits (e.g., mild weakness and dysarthria) who show early improvement are usually managed with secondary prevention measures rather than aggressive reperfusion therapies. The patient’s initial ischemic insult likely led to a partially occluded vessel. Spontaneous reperfusion can occur, resulting in early clinical improvement. However, there remains residual ischemic injury causing mild deficits. The pathophysiologic basis of most minor strokes involves small clot propagation or embolization with limited infarct core. An improving neurological exam (following commands, residual dysarthria, and mild weakness) suggests that the major ischemic core is potentially limited and the penumbra has been salvaged. This clinical picture classifies her presentation as a minor stroke rather than a severe event that would warrant advanced recanalization imaging or interventions. The initial workup in stroke always includes a noncontrast CT to rule out hemorrhage. In patients with severe deficits and suspected large vessel occlusion, CTA plays an essential role. However, in minor strokes with clinical improvement, extensive vascular imaging (like CTA) may not alter immediate management. Differential diagnoses include transient ischemic attack (if symptoms resolve completely), stroke mimics (seizure, migraine, hypoglycemia), or progressive lacunar infarcts, and these are differentiated through detailed history, exam, and imaging. For minor strokes with non‐disabling deficits, the current guidelines recommend initiation of antithrombotic therapy for secondary stroke prevention. A tiered approach is used: first‐line therapy is dual antiplatelet therapy (typically aspirin plus clopidogrel) initiated within 24 hours of symptom onset for a short duration (usually 21 to 90 days) based on trials such as CHANCE and POINT. Pregnancy and lactation considerations: Low‐dose aspirin is generally considered safe during pregnancy and lactation, though clopidogrel is used with caution and typically avoided in pregnancy unless clearly indicated. A: IV tPA – Not indicated here since the patient has already shown improvement and the deficits are minor; tPA’s risk‐benefit ratio does not favor its use in minor, non-disabling deficits. B: Brain CTA – Although vascular imaging is useful in patients suspected of large vessel occlusion, in the context of minor deficits with improvement, CTA is unlikely to change management. C: Thrombectomy – Reserved for patients with large vessel occlusions and significant deficits, not for minor strokes. D: Dual antiplatelets – Correct because secondary prevention with dual antiplatelet therapy is the current guideline-recommended approach for minor stroke patients. 1) Rapid clinical improvement in stroke does not eliminate the risk of subsequent events; secondary prevention is mandatory. 2) Reperfusion therapies (IV tPA and thrombectomy) are generally reserved for patients with disabling deficits. 3) Dual antiplatelet therapy has been shown to reduce the risk of early recurrent stroke in patients with minor non‐disabling ischemic stroke. Recent large-scale trials (e.g., CHANCE and POINT) have confirmed that short-term dual antiplatelet therapy reduces the risk of recurrent stroke in patients with minor stroke or TIA. Contemporary guidelines support conservative management (antiplatelet therapy) in patients who demonstrate early neurological improvement rather than escalating to advanced imaging like CTA that is geared towards interventional decision-making.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "82 years old female, DM/HTN/DLP. Presented with sudden left gaze preference, aphasia, dense right hemiplegia. Her basic labs and INR are fine. She has no contraindications for tPA. Brain CT attached (normal). What is next? NB: time from symptoms onset to ER arrival was 30 minutes.",
    "options": {
      "option_a": "IV tPA",
      "option_b": "Brain CTA",
      "option_c": "Thrombectomy",
      "option_d": "Dual antiplatelets",
      "option_e": ""
    },
    "correct_answer": "A",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Acute ischemic stroke is often diagnosed using a combination of clinical evaluation and imaging. In patients within the therapeutic window (typically within 4.5 hours), IV thrombolysis (tPA) remains the mainstay treatment if no contraindications exist. The occlusion of a cerebral artery leads to a cascade of ischemia, resulting in neuronal injury. In this case, the dense right hemiplegia, aphasia, and left gaze preference suggest a left hemispheric large vessel occlusion. The CT is normal because early ischemic changes might not be visible immediately. The patient exhibits classical signs of a left middle cerebral artery (MCA) stroke: right hemiplegia, expressive/receptive aphasia, and gaze deviation. The absence of hemorrhage on CT and the clear time window (30 minutes from symptom onset) support the use of IV tPA. The initial evaluation involves a rapid noncontrast CT scan to rule out hemorrhage. Differential diagnoses include stroke mimics (e.g., seizure, migraine, hypoglycemia) and hemorrhagic stroke. In this situation, the clinical exam in conjunction with imaging confirms an ischemic stroke. For eligible patients within 4.5 hours from symptom onset and without contraindications, IV tPA is the first-line therapy. This patient fits those criteria. In addition to thrombolysis, attention should be given to secondary prevention, including antiplatelet therapy, statin therapy, and risk factor modification. Pregnancy and lactation considerations are not applicable in this 82-year-old patient; however, in pregnant patients, IV tPA has been used cautiously when benefits outweigh risks and in the absence of contraindications. A: IV tPA – Correct, as the patient is within the time window, has no contraindications and a normal CT ruling out hemorrhage. B: Brain CTA – While useful in assessing for large vessel occlusion, the primary next step is thrombolysis given her eligibility. C: Thrombectomy – Reserved for patients with large vessel occlusion who have significant deficits; although it may be considered if CTA shows a treatable occlusion, IV tPA is first-line here. D: Dual antiplatelets – Secondary prevention is important, but the immediate priority in this acute setting is reperfusion with IV tPA. 1) In acute ischemic stroke, time is critical; administering IV tPA within the window significantly improves outcomes. 2) A normal CT does not rule out ischemia; early ischemic changes may take time to appear. 3) Always rule out contraindications before thrombolytic therapy. Landmark trials such as NINDS and ECASS III have validated the efficacy of IV tPA in acute ischemic stroke when administered within 4.5 hours of symptom onset. Current American Heart Association/American Stroke Association guidelines continue to support this management strategy.",
    "exam_year": "2022",
    "exam_type": "Part I",
    "image_url": "page_3.png"
  },
  {
    "question_text": "Elderly female with sudden onset of left gaze preference. She is DM/HTN/DLP. On examination she has persisted left sided gaze preference that couldn't be overcome. What else you might find in her examination?",
    "options": {
      "option_a": "Rt LMN Facial palsy",
      "option_b": "Lt LMN Facial palsy",
      "option_c": "Rt UMN Facial palsy",
      "option_d": "Lt UMN Facial palsy",
      "option_e": ""
    },
    "correct_answer": "C",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Conjugate gaze deviation is a common finding in cortical strokes involving the frontal eye field. In such strokes, the eyes deviate toward the side of the lesion due to loss of contralateral gaze control. The frontal eye field is responsible for directing the eyes contralaterally. When there is an acute infarct (often in the territory of the middle cerebral artery), the loss of inhibitory input causes the eyes to deviate toward the side of the lesion. Moreover, due to the crossing of the corticobulbar pathways, the contralateral lower face exhibits an upper motor neuron (UMN) pattern of weakness. In this elderly female patient with vascular risk factors, a persistent left gaze preference suggests a left hemispheric cortical involvement. As a result, the right-sided lower facial weakness (UMN type) would be expected. This aligns with the classical neurological examination findings in an MCA distribution stroke. The evaluation includes detailed neurological examination and neuroimaging. Differential diagnoses to consider include brainstem lesions, which can also cause gaze abnormalities but typically present with additional cranial nerve deficits, and peripheral facial nerve palsies, which present with lower motor neuron (LMN) patterns. Management of ischemic strokes includes acute thrombolytic therapy when appropriate, followed by secondary prevention strategies including antiplatelet therapy, risk factor modification, and rehabilitation. In pregnant or lactating patients, while thrombolytic therapy is used with caution, the overall management principles remain similar with adjustments based on risk-benefit assessments. A: Right LMN Facial palsy – Incorrect; LMN lesions affect the entire half of the face and are not typically associated with cortical strokes. B: Left LMN Facial palsy – Incorrect for the same reason and does not correlate with the side of the lesion. C: Right UMN Facial palsy – Correct; in a left hemispheric stroke, the contralateral (right) lower facial weakness due to an upper motor neuron lesion is the typical finding. D: Left UMN Facial palsy – Incorrect as this would imply a right hemispheric lesion, conflicting with the left gaze deviation. 1) In cortical strokes, gaze deviation is typically toward the side of the lesion. 2) UMN facial weakness spares the forehead due to bilateral cortical innervation. 3) A careful neuro exam correlates well with the affected vascular territory. Recent studies and guideline recommendations continue to emphasize the importance of correlating clinical findings with imaging to accurately localize strokes. The pattern of gaze preference combined with contralateral UMN facial weakness is a classic and still widely taught sign in acute stroke assessment.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "What is the mechanism?",
    "options": {
      "option_a": "",
      "option_b": "",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Understanding the mechanism of hemorrhage in the brain is essential. While hypertension is a common etiology for intracerebral hemorrhage, other mechanisms such as coagulopathy directly impair the body’s ability to form clots and thus predispose patients to bleeding. In patients with coagulopathy, whether due to anticoagulant medications, liver disease, or inherent clotting factor deficiencies, the normal coagulation cascade is disrupted. This impairment in hemostasis leads to an increased risk of spontaneous bleeding, including intracerebral hemorrhage. Unlike hypertension-related hemorrhages, which occur from chronic vessel wall damage in deep brain structures, coagulopathy-related bleeds can occur in various brain locations without preceding vessel remodeling. In the clinical scenario described, the hemorrhage is best explained by a coagulopathic state. This is supported by the absence of the typical deep intracerebral hemorrhage seen with chronic hypertension and the laboratory findings pointing toward coagulation abnormalities. The diagnostic workup includes neuroimaging, primarily CT scans, as well as laboratory tests such as prothrombin time (PT), activated partial thromboplastin time (aPTT), and international normalized ratio (INR). Differential diagnoses include hypertensive hemorrhage and aneurysmal subarachnoid hemorrhage (the latter often presenting with a different clinical picture and hemorrhage pattern). A careful review of the patient’s clinical history and laboratory data helps distinguish these entities. Management involves rapid reversal of the coagulopathy, supportive care, and stabilization of intracranial pressure. The specific reversal strategy depends on the underlying cause (e.g., vitamin K or fresh frozen plasma for warfarin-related coagulopathy, or specific factor concentrates). In pregnant or lactating patients, careful consideration is needed when administering reversal agents and balancing the risks of hemorrhage against potential adverse effects on the fetus or neonate; multidisciplinary consultation is often warranted. Option 1 (Hypertension) is incorrect because while hypertension is a leading cause of intracerebral hemorrhage, it operates through chronic vessel wall changes and is not the mechanism in a scenario marked by early coagulation abnormalities. Option 2 (Coagulopathy) is correct because it directly disrupts the clotting cascade, leading to bleeding. Option 3 (Aneurysm) is incorrect; aneurysmal rupture typically results in subarachnoid hemorrhage rather than a parenchymal bleed associated with coagulopathy. 1) Always consider a patient’s coagulation status when evaluating spontaneous intracerebral hemorrhage. 2) Coagulopathy can cause intracerebral hemorrhage in the absence of chronic vascular diseases such as hypertension. 3) Prompt identification and reversal of coagulopathy can be life-saving. Recent guidelines and research underscore the importance of rapid diagnosis and correction of coagulopathy in patients with intracerebral hemorrhage. Studies have demonstrated improved outcomes with faster reversal strategies, and updated protocols emphasize tailored management based on the underlying etiology of the hemorrhage.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "What you can see with RCVS",
    "options": {
      "option_a": "Low glucose",
      "option_b": "",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Reversible Cerebral Vasoconstriction Syndrome (RCVS) is characterized by sudden, severe (“thunderclap”) headaches and reversible segmental narrowing of cerebral arteries. Recognizing its typical imaging findings is crucial for diagnosis. RCVS reflects transient dysregulation of cerebrovascular tone, often triggered by vasoactive substances, the postpartum state, or certain medications. The fluctuating vasospasm produces a characteristic pattern of multifocal arterial narrowing that reverses over time. Patients with RCVS typically present with sudden-onset, severe headaches. Some may develop focal neurologic deficits or experience seizures. Importantly, imaging often reveals the hallmark multifocal and segmental narrowing of cerebral vessels. Diagnosis relies on neuroimaging. Magnetic resonance angiography (MRA), computed tomography angiography (CTA), or digital subtraction angiography (DSA) typically reveal a ‘string-of-beads’ appearance due to alternating constriction and dilation. Differential diagnoses include aneurysmal subarachnoid hemorrhage, primary angiitis of the central nervous system, and cerebral vasculitis. Management is predominantly supportive. First‐line treatment includes removal of any offending agents and symptomatic management. Calcium channel blockers (such as nimodipine or verapamil) may be used to alleviate vasoconstriction. In pregnant or lactating patients, careful drug selection is essential; for example, although many calcium channel blockers are category C, they may be used if the benefits outweigh the potential risks. Option A (Low glucose) is not a feature of RCVS and does not reflect the underlying vascular abnormality. Although the other options were not explicitly provided, the correct answer should highlight the reversible vasoconstrictive changes seen on imaging – corresponding to Option B. 1. RCVS is most commonly identified by its thunderclap headache and reversible, multifocal segmental vasoconstriction on angiographic studies. 2. It is important not to confuse RCVS with primary vasculitis, as the treatment strategies differ markedly. Recent research emphasizes early and accurate imaging to differentiate RCVS from other cerebral vasculopathies. Updated guidelines advocate for supportive management with avoidance of triggers, reinforcing that abnormal glucose levels are not a feature of this condition.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "60 years old male pt DM/ HTN/ came with history of TiA for 10 min numbness and dysarthtia. NiHSs is 3. We have to calculate ABCD2 score. On examination ot still have numbness what you will give",
    "options": {
      "option_a": "aspirin",
      "option_b": "plavix",
      "option_c": "dual",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "C",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "The ABCD2 score is a clinical tool for risk-stratifying patients after a transient ischemic attack (TIA) to predict the short-term risk of stroke. It incorporates Age, Blood pressure, Clinical features, Duration of symptoms, and Diabetes. TIAs result from transient cerebral ischemia, often due to embolism or small vessel occlusion in the setting of underlying atherosclerosis. The score reflects the cumulative risk imposed by these factors. In a 60‐year‐old male with traditional vascular risk factors and a transient episode of neurological deficits, a high ABCD2 score indicates a substantial risk for future stroke. Persistent neurologic deficits (such as ongoing numbness) further raise concern and influence treatment intensity. Differentiation involves excluding mimics like migraine, seizure-related symptoms, or hypoglycemia. Neuroimaging (CT/MRI) is needed to rule out acute infarction and to evaluate for underlying vascular pathology. Current guidelines, informed by trials such as CHANCE and POINT, support the initiation of dual antiplatelet therapy (aspirin plus clopidogrel) within 24 hours of a high-risk TIA or minor stroke and continuing it for 21–90 days before transitioning to monotherapy. Although this patient is a 60-year-old male, these principles are standard; in pregnant or lactating patients, low-dose aspirin is often acceptable, but clopidogrel has a less established safety profile and is generally used with caution. Option A (aspirin alone) and Option B (clopidogrel alone) may be considered in lower-risk settings, but for high-risk TIA, dual therapy (Option C) has been proven superior in reducing early recurrent stroke risk. Option D was not provided. 1. Dual antiplatelet therapy is beneficial when initiated early in high-risk TIA or minor stroke patients to reduce recurrent stroke risk. 2. The ABCD2 score is an essential clinical tool for determining the intensity of secondary prevention strategies. Large-scale trials, including CHANCE and POINT, have firmly established the benefit of dual antiplatelet therapy in reducing stroke recurrence in patients with high ABCD2 scores, thereby shaping current guideline recommendations.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "What you will do:",
    "options": {
      "option_a": "(angioplasty alone) is not recommended because it can lead to vessel recoil and restenosis. Option B (stenting) is typically reserved for patients who cannot undergo surgery, while Option C (endarterectomy) is an option for selected high",
      "option_b": "",
      "option_c": "",
      "option_d": "(medical therapy) is the most appropriate initial approach in a broad range of patients with large vessel stenosis.",
      "option_e": ""
    },
    "correct_answer": "D",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Management of symptomatic large vessel cerebrovascular stenosis requires an evaluation of both the severity of the stenosis and the symptoms. The initial treatment approach generally prioritizes optimized medical management over immediate invasive procedures. Atherosclerotic disease in large vessels, such as the carotid arteries, leads to narrowing and turbulent flow that predisposes to thromboembolic events and hypoperfusion. The chronic inflammatory process leads to plaque formation and progression of stenosis. Patients with symptomatic stenosis presenting with TIA or minor stroke symptoms are at risk for further ischemic events. While invasive procedures like endarterectomy or stenting can reduce stroke risk in selected patients, many individuals initially benefit from aggressive medical therapy that addresses risk factors and stabilizes plaque. Diagnosis is typically confirmed by noninvasive imaging modalities such as carotid duplex ultrasonography, CTA, or MRA. Differential diagnoses include intracranial atherosclerosis, vasculitis, and cardioembolic sources; the degree of stenosis guides the treatment plan. Current guidelines emphasize that the first-line management for most patients with large vessel stenosis is optimized medical therapy. This includes antiplatelet agents (often aspirin ± clopidogrel), high-intensity statin therapy, strict blood pressure control, and lifestyle modification. In patients with high-grade (typically >70%) symptomatic stenosis, carotid endarterectomy (CEA) may be indicated if the patient is an appropriate surgical candidate. Carotid stenting is reserved for patients with contraindications to surgery. In pregnant and lactating patients, medications must be selected for safety; for example, low-dose aspirin is generally acceptable in pregnancy, whereas many statins and interventional procedures are contraindicated or require special consideration. Option A (angioplasty alone) is not recommended because it can lead to vessel recoil and restenosis. Option B (stenting) is typically reserved for patients who cannot undergo surgery, while Option C (endarterectomy) is an option for selected high-grade stenosis cases but is not universally required. Option D (medical therapy) is the most appropriate initial approach in a broad range of patients with large vessel stenosis. 1. Optimal medical management, including risk factor modification, is the cornerstone of treatment for cerebrovascular stenosis. 2. Invasive interventions should be reserved for carefully selected patients after a thorough evaluation of stenosis severity. Recent trials such as SAMMPRIS and CREST have underscored the efficacy of aggressive medical therapy in reducing recurrent stroke risk and have helped refine the indications for interventional procedures in patients with large vessel cerebrovascular disease.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "sickler pt come with stroke work up done and found to have multiple stenosis in AcA and McA. Ehat is the method of prevention?",
    "options": {
      "option_a": "aspirin",
      "option_b": "plavix",
      "option_c": "chronic transfusion",
      "option_d": "dual antiplate",
      "option_e": ""
    },
    "correct_answer": "C",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "In patients with sickle cell disease (SCD), the abnormal hemoglobin leads to red blood cell sickling, which can cause vaso-occlusion and vascular injury, notably in cerebral vessels. This predisposes them to stroke and progressive vasculopathy. The sickling of red blood cells in SCD results in chronic hemolysis and microvascular occlusions. Repeated vaso-occlusive events damage the endothelium, leading to intimal hyperplasia and progressive arterial stenosis, particularly affecting major intracranial arteries such as the anterior (AcA) and middle cerebral arteries (McA). SCD patients are at high risk for both overt and silent strokes, often presenting with transient ischemic attacks or neurological deficits. The identification of multiple intracranial stenoses on stroke workup is a common finding in this population. The evaluation involves neuroimaging studies, including MRA or CTA, to assess vessel patency and differentiate SCD vasculopathy from other conditions such as atherosclerotic disease or inflammatory vasculitis. Differential diagnoses include moyamoya syndrome and other forms of vasculitis. Chronic blood transfusion therapy is the cornerstone of both primary and secondary stroke prevention in SCD. Regular transfusions work by reducing the proportion of hemoglobin S below 30%, thereby minimizing sickling events and reducing stroke risk. Hydroxyurea may be considered as an adjunct therapy in some cases. In pregnant or lactating patients with SCD, transfusion protocols must be carefully managed by a multidisciplinary team, balancing maternal and fetal risks while ensuring optimal reduction in stroke risk. Option A (aspirin) and Option B (clopidogrel) are antiplatelet regimens typically used in atherosclerotic stroke prevention and do not address the underlying pathophysiology of SCD. Option D (dual antiplatelet therapy) similarly fails to alter the sickling process. Option C (chronic transfusion) is the established and effective method for stroke prevention in SCD by reducing the hemoglobin S load. 1. Chronic transfusion therapy remains the standard of care for stroke prevention in SCD, targeting a reduction in hemoglobin S levels. 2. SCD vasculopathy involves unique mechanisms distinct from atherosclerotic disease, thus requiring different treatment strategies. Recent studies continue to support the efficacy of chronic transfusion protocols in reducing stroke incidence in SCD patients. Ongoing research into adjunctive therapies, including hydroxyurea and gene therapy, aims to further improve outcomes in this high-risk population.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "What is the mechanism?",
    "options": {
      "option_a": "",
      "option_b": "",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question focuses on the mechanism underlying a specific subtype of subarachnoid hemorrhage (SAH) – the premesencephalic hemorrhage. Unlike the more common aneurysmal SAH, premesencephalic hemorrhage is a nonaneurysmal bleed localized to the pre‐mesencephalic cisterns. Premesencephalic hemorrhage is thought to arise from a venous or minor arterial source rather than from a ruptured aneurysm. Its bleeding is confined to the cisterns anterior to the midbrain with no aneurysm detected on vascular imaging. This distinct mechanism accounts for its generally benign clinical course compared with the typical aneurysmal bleed. Clinically, patients with a premesencephalic hemorrhage usually present with a less severe headache with fewer neurological deficits and have a lower risk of complications such as re-bleeding or vasospasm. Radiographically, the hemorrhage is localized, and CT angiography fails to reveal an aneurysm. The evaluation begins with a noncontrast head CT to confirm SAH. Given the hemorrhage’s characteristic location, a CT angiogram (CTA) is used to exclude aneurysmal causes. In ambiguous cases, lumbar puncture may be performed. Differential diagnoses include aneurysmal SAH, perimesencephalic hemorrhage from other causes, and other intracranial hemorrhages. Management is mainly supportive. Patients are observed and managed conservatively with pain control and blood pressure regulation since there is no aneurysm to secure. In patients with this hemorrhage, aggressive interventions such as surgical clipping or coiling are not warranted. During pregnancy and lactation, conservative management remains the mainstay while monitoring maternal and fetal status. Option 1 (Aneurysm rupture) is incorrect because, while it is the most common cause of SAH, it does not account for the localized bleeding pattern and benign course of premesencephalic hemorrhage. Option 2 (Atherosclerosis) is not a cause of SAH but is linked to ischemic events. Option 3 (Premesencephalic hemorrhage) is the correct mechanism as it specifically describes the nonaneurysmal bleed observed in this scenario. Option 4 is not provided. 1. Premesencephalic SAH has a better prognosis than aneurysmal SAH. 2. Its characteristic CT findings (localized anterior to the midbrain) help differentiate it from aneurysmal SAH. 3. CTA is essential to rule out an aneurysm before determining conservative management. Recent studies support that in cases of SAH with a premesencephalic pattern and no vascular lesions on CTA, conservative management yields favorable outcomes. Advances in imaging continue to improve our ability to distinguish between aneurysmal and nonaneurysmal causes, thereby optimizing patient management.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "82 years old male pt came within 3 hrs and have no contraindication for tpa and ct attached with early signe of stroke but infarction not established what you will give",
    "options": {
      "option_a": "aspirin",
      "option_b": "plavix",
      "option_c": "tpa",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "C",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question addresses the acute management of ischemic stroke in the hyperacute phase. The mainstay treatment for eligible patients is thrombolysis with tissue plasminogen activator (tPA). In ischemic stroke, clot formation leads to occlusion of cerebral blood vessels, resulting in neuronal ischemia and infarction. Early restoration of blood flow with tPA can dissolve the thrombus, limiting tissue damage and improving outcomes. The patient, an 82‐year‐old male, presented within 3 hours of symptom onset with early signs on CT but without established infarction. The absence of contraindications combined with the timely presentation makes him a good candidate for tPA despite advanced age. Initial evaluation includes a noncontrast head CT to rule out hemorrhage, assessment of stroke symptoms, and careful review of contraindications. Differential diagnoses include stroke mimics such as seizures or hypoglycemia. However, early ischemic changes assessed on CT support the diagnosis of acute ischemic stroke. The current guidelines recommend intravenous tPA as a first-line treatment for eligible patients presenting within 3 hours (and in select cases up to 4.5 hours) of stroke onset. In elderly patients, tPA is not contraindicated; careful evaluation of bleeding risk is crucial. In pregnancy and lactation, tPA can be used if benefits outweigh risks, though data in these populations are limited and management should be individualized. Option A (Aspirin) and Option B (Plavix) are antiplatelet agents generally used for secondary prevention, not for acute reperfusion. Option C (tPA) is the correct choice as it is the established treatment in the hyperacute period when no contraindications exist. Option D is not provided. 1. Time is brain: early administration of tPA is critical. 2. Advanced age alone is not a contraindication for tPA. 3. CT imaging is essential to rule out hemorrhage before initiating therapy. Recent AHA/ASA updates affirm the benefit of tPA in eligible patients within the 3-hour window, with growing evidence supporting its use in patients over 80 years old, provided contraindications are absent. Ongoing research continues to refine selection criteria, including the use of advanced imaging techniques.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "pt suddenly explaned to his wife seeing animals and fade after while pt loss consciousness / EMd arrived. Take him to the hospital intubation done. Attache Ct scan. New left occipital stroke. What you will do? Pt presneted with window not mention bt writeen sudden and within 1 hr",
    "options": {
      "option_a": "cta",
      "option_b": "EEG",
      "option_c": "tpa",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "C",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question involves the acute management of an ischemic stroke presenting with occipital lobe involvement, where symptoms may include visual disturbances such as seeing animals (visual hallucinations). An infarct in the occipital lobe affects the visual processing center of the brain, leading to phenomena such as visual hallucinations or altered vision. This ischemic process results from an arterial occlusion that, if treated promptly, can be salvaged using reperfusion therapy. The case describes a patient with a new left occipital stroke who presented acutely (within 1 hour), making him an ideal candidate for thrombolytic therapy. Despite being intubated, if there are no contraindications and the patient is within the therapeutic window, tPA can significantly improve outcomes. A noncontrast CT scan is performed first to exclude hemorrhage, supported by clinical history. Although additional studies like CT angiogram (CTA) can help visualize vessel occlusion, the immediate determination of eligibility for tPA is paramount. Differential diagnosis would include seizure activity or other visual disturbances, but imaging confirming a new infarct solidifies the diagnosis. For eligible patients presenting within the approved time window (up to 4.5 hours, with the greatest benefit seen earlier), IV tPA is recommended as first-line therapy. The decision remains similar even in patients who have been intubated, provided airway management and supportive care are ensured. In pregnancy and lactation, treatment with tPA is considered on a case-by-case basis, weighing risks and benefits, though available data remain limited. Option A (CTA) is an imaging modality that can further evaluate vessel occlusion but is not a treatment. Option B (EEG) is unrelated and used to assess for seizures. Option C (tPA) is the appropriate therapeutic intervention to achieve reperfusion in an acute ischemic stroke. Option D is not provided. 1. Occipital strokes may present with visual hallucinations or disturbances. 2. Rapid identification and treatment with tPA are critical within the treatment window. 3. Intubation should not automatically preclude the use of tPA if other criteria are met. Current guidelines from the AHA/ASA strongly support the use of tPA in patients with acute ischemic stroke presenting within the therapeutic window. Research continues into optimizing patient selection using advanced imaging techniques to extend reperfusion therapy to more patients.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "What yoi will do?",
    "options": {
      "option_a": "Shunt",
      "option_b": "anticoagulant",
      "option_c": "give",
      "option_d": "give LMWH",
      "option_e": ""
    },
    "correct_answer": "A",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question appears to ask for the next step in management, but the lack of clinical context (such as the underlying diagnosis or situation) makes it ambiguous. The provided options range from a surgical intervention (shunt), general anticoagulation, an unspecified 'give', or the use of low molecular weight heparin (LMWH). Without a clear clinical scenario, it is not possible to ascertain the underlying pathophysiological process. For instance, a shunt would be used for managing hydrocephalus, whereas LMWH is typically used for thromboembolic prophylaxis or treatment, and the generic term 'anticoagulant' could apply to multiple vascular conditions. The options suggest two distinct clinical pathways: one related to neurosurgical management (shunt placement for hydrocephalus) and the other related to medical management (anticoagulation or LMWH for thromboembolism or stroke prophylaxis). Without additional patient history, imaging details, or a specific diagnosis, correlating these options to a clinical presentation is not feasible. A proper diagnostic workup would require detailed history, physical examination, and appropriate imaging studies to differentiate between conditions such as normal-pressure hydrocephalus, cerebral venous thrombosis, or post-stroke deep venous thrombosis prophylaxis. Differential diagnoses might include hydrocephalus, acute ischemic stroke with subsequent thrombosis risk, or another cerebrovascular abnormality. Management should be tailored based on the definitive diagnosis. If the issue were hydrocephalus, a shunt procedure (typically a ventriculoperitoneal shunt) would be indicated. Conversely, if the patient has a thromboembolic disorder (such as cerebral venous thrombosis or requires DVT prophylaxis post-stroke), the use of anticoagulants like LMWH is appropriate. In pregnancy and lactation, LMWH is preferred over other anticoagulants because it does not cross the placenta and has a favorable safety profile during breastfeeding. Option A (Shunt) is correct if the underlying problem is hydrocephalus but irrelevant if the condition is thromboembolic in nature. Option B (anticoagulant) is a broad term and might be applicable in multiple scenarios but is non-specific. Option C (give) is incomplete and provides no actionable information. Option D (give LMWH) is appropriate for thromboembolic conditions (e.g., for prophylaxis in immobilized patients or in the treatment of cerebral venous thrombosis) as well as for VTE prevention in high-risk patients, including those who are pregnant or lactating. However, without further context, it is impossible to choose definitively among these. 1. Always ensure that a question provides adequate clinical context before selecting a management option. 2. In cases of cerebrospinal fluid buildup (hydrocephalus), a shunt is indicated, while in thromboembolic conditions, anticoagulation (preferably LMWH in pregnancy/lactation) is preferred. Recent guidelines underscore the importance of tailoring stroke and hydrocephalus management to the individual patient based on imaging and clinical presentation. In conditions requiring anticoagulation, LMWH remains the agent of choice in pregnant and lactating women due to its safety profile. However, current evidence also highlights the necessity of a precise diagnosis before initiating treatment.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "Long senario pt came with anyrism rupture of PcOm what you will do?",
    "options": {
      "option_a": "Cliping",
      "option_b": "Coiling",
      "option_c": "Decompressivw craniotomy",
      "option_d": "Amdission to stroke unit",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "Ruptured cerebral aneurysms, particularly those in the region of the posterior communicating artery (PCOM), lead to subarachnoid hemorrhage. The core concept is that rapid hemorrhage into the subarachnoid space may cause sudden, severe headache (often described as thunderclap headache) and neurological deficits, necessitating prompt intervention to secure the aneurysm and prevent re-bleeding. Aneurysms form due to the weakening of the arterial wall and, when ruptured, cause bleeding into the subarachnoid space. This generates a rise in intracranial pressure, risk of cerebral vasospasm, and ischemic injury to surrounding brain tissue. PCOM aneurysms are common and sometimes manifest with third nerve palsy due to proximity to the oculomotor nerve. Patients commonly present with a sudden, severe headache, nausea, vomiting, and sometimes loss of consciousness. Specific to PCOM aneurysms, unilateral oculomotor nerve palsy with ptosis and a dilated pupil may be observed due to the compressive effects of an enlarging aneurysm or hemorrhage. The initial diagnosis is typically made using a noncontrast CT scan to detect subarachnoid blood. This is followed by CT-angiography or digital subtraction angiography (DSA) to localize the aneurysm. Differential diagnoses include perimesencephalic subarachnoid hemorrhage and hypertensive hemorrhage, which can be differentiated by the bleeding pattern and location. Early securing of the aneurysm is the priority. Current guidelines suggest that endovascular coiling is preferred in many cases due to less invasiveness and favorable outcomes (as shown by the ISAT trial) if the aneurysm’s anatomy is amenable. Surgical clipping remains an alternative if endovascular coiling is not feasible. Post-procedure, patients require management of vasospasm (typically with nimodipine), control of intracranial pressure, and supportive care. In pregnant patients, special considerations include minimizing radiation exposure (with appropriate shielding) and careful monitoring of fetal status during any interventional procedure, whereas during lactation, most contrast agents and anesthesia drugs are considered relatively safe with proper guidance. Option A (Clipping) is an acceptable treatment alternative but is generally reserved for aneurysms with unfavorable coiling anatomy. Option B (Coiling), the marked answer, is preferred in many centers for PCOM aneurysms due to lower procedural morbidity. Option C (Decompressive craniotomy) is not a direct treatment for an aneurysm rupture but may be used later in cases with malignant edema. Option D (Admission to stroke unit) is inadequate as definitive management and does not secure the aneurysm. 1. PCOM aneurysms can present with cranial nerve III palsy. 2. Early intervention is crucial to prevent re-bleeding and vasospasm. 3. Endovascular coiling offers a less invasive option with favorable outcomes in selected patients. Recent guidelines and trials (such as ISAT) support the use of endovascular coiling in appropriate aneurysms due to reduced morbidity and similar long-term outcomes to clipping. Ongoing research is focused on further refining patient selection and improving endovascular techniques.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "Male 56 years old male pt found in teh house with decreas level of consuos Last tome seen normal 1 day back Brain ct scan showed:",
    "options": {
      "option_a": "tpa",
      "option_b": "admission to stroke unite",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "The management of stroke patients depends critically on the timing from symptom onset. In this scenario, a 56‐year‐old man was found with decreased consciousness and a known last normal time of 24 hours ago, which is well beyond the therapeutic window for thrombolytic therapy. Ischemic strokes are caused by occlusion of cerebral arteries leading to ischemia and infarction of brain tissue. The prolonged occlusion results in neuronal death and can cause significant deficits. The diminished level of consciousness could be from a large stroke or associated edema. Patients with ischemic stroke may present with various focal neurological deficits. A decreased level of consciousness in an elderly patient along with imaging findings on CT (even if not detailed here) necessitates prompt evaluation, though reperfusion therapies are time-sensitive. A noncontrast CT scan is generally performed to rule out hemorrhage. In patients presenting beyond the thrombolytic window, advanced imaging modalities like CT perfusion or MRI may be used in select cases to assess salvageable brain tissue. Differentials include hemorrhagic stroke, hypoglycemia, and seizure post-ictal states. Given that the patient is outside the therapeutic window for tPA (typically within 3-4.5 hours from onset), the current evidence supports admission to a dedicated stroke unit where specialized care, supportive management, and secondary prevention strategies are initiated. For pregnant patients with stroke, management must balance maternal benefits against fetal safety, with careful use of imaging and medications. For lactating mothers, medication choices are adjusted based on excretion in breast milk. Option A (tPA) is contraindicated due to the elapsed time since last known well. Option B (Admission to stroke unit) is appropriate and correct as specialized stroke care can improve outcomes. Options C and D are not provided or applicable in this context. 1. 'Time is brain' – rapid recognition and treatment are essential in stroke. 2. Patients discovered beyond the tPA window should be managed in a stroke unit to optimize supportive care and secondary prevention. 3. Advanced imaging may extend treatment windows in select patients but 24 hours is generally too long for standard tPA protocols. Recent studies confirm that dedicated stroke unit care consistently improves survival and functional outcomes. Although advanced imaging techniques have allowed for extended therapy windows in some cases (e.g., DAWN and DEFUSE 3 trials), these are typically limited to carefully selected patients within 24 hours and not applicable in a general scenario as described here.",
    "exam_year": "2022",
    "exam_type": "Part I",
    "image_url": "page_9.png"
  },
  {
    "question_text": "What is the artey?",
    "options": {
      "option_a": "mca",
      "option_b": "pca",
      "option_c": "ant choroidal artery",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "A",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question focuses on identifying the cerebral artery involved based on a presumed clinical or radiological scenario. The Middle Cerebral Artery (MCA) is the most commonly affected artery in ischemic strokes due to its direct flow from the internal carotid artery and its large territory of perfusion. Occlusion of the MCA typically leads to infarction in the regions of the brain it supplies. This results from thromboembolism or atherosclerotic narrowing. The large territory of the MCA means that occlusions often produce significant neurological deficits. Clinically, an MCA stroke often manifests with contralateral weakness (especially affecting the face and arm), sensory deficits, and if the dominant hemisphere is involved, aphasia. Visual field deficits may also occur if the inferior division is involved. Initial imaging with a noncontrast CT scan is used to exclude hemorrhage. MRI with diffusion-weighted imaging and CT angiography are instrumental in confirming an MCA occlusion and assessing the extent of core infarction versus salvageable penumbra. Differentials would include PCA infarction (which typically affects the occipital lobe and causes visual deficits) and anterior choroidal artery infarction (which often produces lacunar syndromes). If within the window, management of an MCA occlusion may include intravenous thrombolysis and/or mechanical thrombectomy for large vessel occlusions. Guidelines emphasize rapid reperfusion therapy and supportive care. For pregnant patients, thrombolysis may be considered on a case-by-case basis with proper precautions. In lactation, most agents used in stroke care have been evaluated for safety, though individual risk assessments are needed. Option A (MCA) is the correct answer, as it is the most common site for ischemic strokes and fits the described scenario. Option B (PCA) supplies the occipital lobe and is less commonly involved in the typical clinical presentation presented. Option C (Anterior choroidal artery) supplies deep brain structures and would usually produce a more restricted clinical syndrome. Option D is not provided. 1. The middle cerebral artery is the most commonly occluded vessel in ischemic stroke. 2. MCA territory infarcts are typically characterized by contralateral hemiparesis and aphasia if the dominant hemisphere is affected. 3. Quick identification and treatment are essential to improve outcomes. Recent guidelines emphasize the role of endovascular thrombectomy in MCA occlusions, particularly in large vessel occlusions, with multiple randomized controlled trials confirming its efficacy in improving functional outcomes.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "What is the mechanism?",
    "options": {
      "option_a": "tramatic haemorrage",
      "option_b": "ICh",
      "option_c": "lobar haemorrage",
      "option_d": "is not provided.",
      "option_e": ""
    },
    "correct_answer": "B",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This question evaluates the understanding of the underlying mechanisms leading to intracranial bleeding. The differentiation between traumatic and spontaneous hemorrhages is critical in neurology. Here, the focus is on spontaneous intracerebral hemorrhage (ICH). Intracerebral hemorrhage typically occurs due to rupture of small penetrating arteries, most commonly as a consequence of chronic hypertension. Long-standing high blood pressure leads to changes in the vessel wall (e.g., formation of Charcot-Bouchard microaneurysms) which predispose them to rupture. Lobar hemorrhages, while a subset of ICH, are often associated with cerebral amyloid angiopathy, particularly in older patients. ICH presents with the sudden onset of headache, vomiting, a decline in levels of consciousness, and focal neurological deficits. The location of the hemorrhage (deep vs. lobar) can provide clues to its etiology; hypertensive ICH frequently occurs in deep structures such as the basal ganglia or thalamus. A noncontrast CT scan is the diagnostic modality of choice for ICH, as it quickly differentiates hemorrhagic from ischemic strokes. MRI can be used in subacute settings for further characterization. Differential diagnoses include traumatic brain hemorrhage, subarachnoid hemorrhage, and lobar hemorrhage due to different etiologies such as amyloid angiopathy. Management of ICH includes rapid blood pressure control, reversal of any coagulopathy, and supportive care. Patients may require neurosurgical evaluation for hematoma evacuation if there is significant mass effect or deterioration in the neurological exam. In pregnant patients, blood pressure control must consider both maternal and fetal safety, with agents chosen that have established safety profiles. In lactating mothers, medication choices are similarly guided by safety data for breastfeeding. Option A (Traumatic hemorrhage) is incorrect in the absence of a history of trauma. Option B (ICH) is the correct answer, representing a spontaneous intracerebral hemorrhage, likely hypertensive in origin. Option C (Lobar hemorrhage) is a subtype of ICH but typically relates to cerebral amyloid angiopathy in the elderly and is less likely in a 56-year-old man; thus, it is less appropriate without specific supporting details. Option D is not provided. 1. Hypertension is the most common risk factor for spontaneous ICH. 2. Blood pressure management is crucial in the acute phase to prevent hemorrhage expansion. 3. Differentiating the hemorrhage location (deep vs. lobar) assists in identifying the underlying etiology. Emerging research focuses on optimal blood pressure targets and minimally invasive surgical techniques for ICH evacuation. Current guidelines recommend early aggressive management of blood pressure and individualized decisions regarding surgical intervention, with ongoing studies further refining best practices.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "Intracranial MCA severe stenosis what next",
    "options": {
      "option_a": "(DAPT) is correct because the SAMMPRIS trial demonstrated that using both aspirin and clopidogrel reduces recurrent stroke risk in severe intracranial stenosis. Other alternatives like single antiplatelet therapy, anticoagulation, or immediate endovascular procedures have either not shown superior benefits or carry higher procedural risks.",
      "option_b": "",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "a",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "This case involves a patient with severe intracranial stenosis of the MCA, a high‐risk condition for recurrent ischemic events. The aim is to stabilize the atherosclerotic plaque and prevent embolization, making antiplatelet therapy the mainstay of management. Severe intracranial stenosis is most commonly due to atherosclerotic disease. The culprit lesion leads to endothelial injury and turbulent blood flow, promoting platelet activation and microembolization. Dual antiplatelet therapy (DAPT)—combining aspirin’s irreversible COX inhibition with clopidogrel’s blockade of the ADP receptor—addresses two different pathways in platelet aggregation, as demonstrated in the SAMMPRIS trial. Clinically, patients might present with transient ischemic attacks or strokes confined to the vascular territory supplied by the affected MCA. The risk of subsequent stroke is high if the stenosis remains untreated, which makes early aggressive management essential. Imaging modalities like CTA, MRA, or digital subtraction angiography (DSA) are used to confirm the degree of stenosis. Differential diagnoses include extracranial carotid stenosis, vasculitis, or other intracranial arteriopathies. Noninvasive vascular imaging usually helps differentiate these conditions. According to current guidelines and the SAMMPRIS trial, the first-line management for symptomatic severe intracranial stenosis is aggressive medical therapy. DAPT (aspirin plus clopidogrel) should be initiated—commonly for 90 days—along with risk factor modification (blood pressure, lipids, glycemic control). Endovascular options (such as stenting) are reserved for cases refractory to medical management. In pregnancy or lactation, low-dose aspirin may be used safely; however, clopidogrel’s safety profile is not as well established. In such scenarios, the risks and benefits should be weighed carefully, often involving a multidisciplinary discussion. Option a (DAPT) is correct because the SAMMPRIS trial demonstrated that using both aspirin and clopidogrel reduces recurrent stroke risk in severe intracranial stenosis. Other alternatives like single antiplatelet therapy, anticoagulation, or immediate endovascular procedures have either not shown superior benefits or carry higher procedural risks. 1. The SAMMPRIS trial firmly supports DAPT in the acute management of symptomatic high-grade intracranial stenosis. 2. Aggressive medical management and risk factor modification remain the cornerstone of therapy. 3. Noninvasive imaging is key to an accurate diagnosis and subsequent management planning. Recent guidelines continue to reinforce that for symptomatic intracranial atherosclerotic disease, DAPT for a period (commonly 90 days) along with intensive risk factor management is the optimal first-line approach. Endovascular intervention is reserved for selected cases when medical management fails.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "Patient with ESRD Scenario with pic showing rt superficial borderzone infarction at MCA/ACA territory asking about next investigation",
    "options": {
      "option_a": "(Brain CTA) is acceptable as the next investigation if it includes imaging of the neck vessels. It is noninvasive and provides reliable information about both intracranial and extracranial vessels. Option b (Conventional angiography) is more invasive and carries a higher risk of complications including stroke, arterial injury, and contrast nephropathy, particularly in ESRD; hence, it is reserved for cases where noninvasive tests are inconclusive or for planning interventional procedures.",
      "option_b": "",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "a",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "In patients with watershed (borderzone) infarcts, it is important to evaluate the entire cerebrovascular axis as these infarcts can be related to either hemodynamic compromise or proximal large vessel disease. Noninvasive vascular imaging is pivotal in clarifying the cause. Borderzone or watershed infarcts occur at the junctions between vascular territories, often due to hypoperfusion or embolic events affecting both intracranial and extracranial vessels. In patients with ESRD, who may have vascular calcifications and concomitant atherosclerosis, assessing both extra- and intracranial vasculature is crucial. In the setting of ESRD and borderzone infarcts, the patient may have subtle neurological deficits. Given the association with renal disease, there is often extensive vascular disease, making comprehensive vascular imaging essential for further management. A CT angiography (CTA) that ideally includes both the intracranial and neck vessels is preferred. Although the option provided mentions brain CTA (which might imply that neck vessels are included as per standard protocol), it is critical to assess for extracranial carotid stenosis as well. Differential diagnoses include embolic stroke from a cardiac source, vasculitis, or internal carotid occlusion. Once vascular imaging is performed, management involves addressing underlying etiologies. First-line investigations include noninvasive CTA (with both brain and neck imaging) due to its rapidity and lower risk. In patients with ESRD, contrast administration must be judicious; however, in those on dialysis the risk of further renal injury is less of a concern. In scenarios involving pregnancy, alternative imaging modalities or minimized contrast protocols should be considered to reduce fetal exposure. Option a (Brain CTA) is acceptable as the next investigation if it includes imaging of the neck vessels. It is noninvasive and provides reliable information about both intracranial and extracranial vessels. Option b (Conventional angiography) is more invasive and carries a higher risk of complications including stroke, arterial injury, and contrast nephropathy, particularly in ESRD; hence, it is reserved for cases where noninvasive tests are inconclusive or for planning interventional procedures. 1. Watershed infarcts should prompt a full evaluation of both intra- and extracranial vasculature. 2. In ESRD patients, the use of CTA remains acceptable due to the limited concern over contrast-induced nephropathy in end-stage disease. 3. Noninvasive imaging is the preferred first step in vascular evaluation. Recent studies endorse the use of comprehensive CTA as an effective, rapid, and safe tool for evaluating patients with suspected cerebrovascular disease. In patients with ESRD, modifications in contrast use are considered, but the overall imaging strategy remains the same.",
    "exam_year": "2022",
    "exam_type": "Part I"
  },
  {
    "question_text": "Minor stroke NIHSS 3 (left side decrease sensation, mild facial weakness) within the window what’s next",
    "options": {
      "option_a": "(DAPT) is incorrect as sole acute treatment because while it reduces recurrent events, it does not actively lyse the clot. Option b (tPA) is correct because clot dissolution is essential for reperfusion in the hyperacute phase of ischemic stroke. Option c (Aspirin alone) is insufficient for acute reperfusion therapy; it is used more for secondary prevention post",
      "option_b": "",
      "option_c": "",
      "option_d": "",
      "option_e": ""
    },
    "correct_answer": "b",
    "subspecialty": "Vascular Neurology/Stroke",
    "explanation": "For patients presenting with a minor stroke (NIHSS 3) within the treatment window, the crucial decision is whether to use IV thrombolysis to restore perfusion. Even minor deficits can be disabling, and timely reperfusion is key. Ischemic stroke results from occlusion of cerebral arteries, leading to infarction of brain tissue downstream. Thrombolytic therapy with tPA initiates enzymatic fibrinolysis of the clot, thereby restoring blood flow and potentially minimizing infarct size if administered early in the time window. Patients with minor stroke symptoms, like decreased sensation and mild facial weakness, may still experience significant disability. Early intervention with IV tPA can improve outcomes by re-establishing perfusion before irreversible damage ensues. The diagnosis of an ischemic stroke is primarily based on clinical assessment and neuroimaging (typically noncontrast CT) to rule out hemorrhage. Differential diagnoses include transient ischemic attack (TIA), migraine with aura, or seizure-related deficits, but imaging along with clinical findings usually clarifies the diagnosis. For eligible patients presenting within 4.5 hours from symptom onset, IV thrombolysis with tPA is considered first-line therapy. Although DAPT (aspirin plus clopidogrel) has proven benefits in secondary prevention (as per the CHANCE and POINT trials), it does not have the reperfusion action required in the hyperacute phase. In the context of pregnancy or lactation, the use of tPA demands a rigorous risk-benefit assessment. Although tPA is not an absolute contraindication during pregnancy, caution is advised due to the potential risk of maternal and fetal hemorrhage; multidisciplinary consultation is recommended. Option a (DAPT) is incorrect as sole acute treatment because while it reduces recurrent events, it does not actively lyse the clot. Option b (tPA) is correct because clot dissolution is essential for reperfusion in the hyperacute phase of ischemic stroke. Option c (Aspirin alone) is insufficient for acute reperfusion therapy; it is used more for secondary prevention post-thrombolysis or when tPA is contraindicated. 1. Even minor strokes with low NIHSS scores can be disabling; timely tPA administration is crucial. 2. The therapeutic time window for tPA is 4.5 hours from symptom onset. 3. DAPT is useful for secondary prevention, not as a replacement for acute thrombolytic therapy. Recent guidelines from the American Heart Association/American Stroke Association continue to recommend IV tPA within the 4.5-hour window for eligible patients, even for minor strokes if deficits are considered disabling. Multiple trials have consolidated the role of thrombolysis in acute management over antiplatelet-only strategies.",
    "exam_year": "2022",
    "exam_type": "Part I"
  }
]